/* automatically generated by rust-bindgen 0.60.1 */

#[repr(C)]
#[derive(Copy, Clone, Debug, Default, Eq, Hash, Ord, PartialEq, PartialOrd)]
pub struct __BindgenBitfieldUnit<Storage> {
    storage: Storage,
}
impl<Storage> __BindgenBitfieldUnit<Storage> {
    #[inline]
    pub const fn new(storage: Storage) -> Self {
        Self { storage }
    }
}
impl<Storage> __BindgenBitfieldUnit<Storage>
where
    Storage: AsRef<[u8]> + AsMut<[u8]>,
{
    #[inline]
    pub fn get_bit(&self, index: usize) -> bool {
        debug_assert!(index / 8 < self.storage.as_ref().len());
        let byte_index = index / 8;
        let byte = self.storage.as_ref()[byte_index];
        let bit_index = if cfg!(target_endian = "big") {
            7 - (index % 8)
        } else {
            index % 8
        };
        let mask = 1 << bit_index;
        byte & mask == mask
    }
    #[inline]
    pub fn set_bit(&mut self, index: usize, val: bool) {
        debug_assert!(index / 8 < self.storage.as_ref().len());
        let byte_index = index / 8;
        let byte = &mut self.storage.as_mut()[byte_index];
        let bit_index = if cfg!(target_endian = "big") {
            7 - (index % 8)
        } else {
            index % 8
        };
        let mask = 1 << bit_index;
        if val {
            *byte |= mask;
        } else {
            *byte &= !mask;
        }
    }
    #[inline]
    pub fn get(&self, bit_offset: usize, bit_width: u8) -> u64 {
        debug_assert!(bit_width <= 64);

pub type paddr_t = u64_;
pub type register_t = u64_;
pub type size_t = ::std::os::raw::c_ulong;
pub type ssize_t = ::std::os::raw::c_long;
pub type __le16 = __u16;
pub type __be16 = __u16;
pub type __le32 = __u32;
pub type __be32 = __u32;
pub type __le64 = __u64;
pub type __be64 = __u64;
pub type bool_t = bool;
pub type xen_pfn_t = u64;
pub type xen_ulong_t = u64;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct vcpu_guest_core_regs {
    pub __bindgen_anon_1: vcpu_guest_core_regs__bindgen_ty_1,
    pub __bindgen_anon_2: vcpu_guest_core_regs__bindgen_ty_2,
    pub __bindgen_anon_3: vcpu_guest_core_regs__bindgen_ty_3,
    pub __bindgen_anon_4: vcpu_guest_core_regs__bindgen_ty_4,
    pub __bindgen_anon_5: vcpu_guest_core_regs__bindgen_ty_5,
    pub __bindgen_anon_6: vcpu_guest_core_regs__bindgen_ty_6,
    pub __bindgen_anon_7: vcpu_guest_core_regs__bindgen_ty_7,
    pub __bindgen_anon_8: vcpu_guest_core_regs__bindgen_ty_8,
    pub __bindgen_anon_9: vcpu_guest_core_regs__bindgen_ty_9,
    pub __bindgen_anon_10: vcpu_guest_core_regs__bindgen_ty_10,
    pub __bindgen_anon_11: vcpu_guest_core_regs__bindgen_ty_11,
    pub __bindgen_anon_12: vcpu_guest_core_regs__bindgen_ty_12,
    pub __bindgen_anon_13: vcpu_guest_core_regs__bindgen_ty_13,
    pub __bindgen_anon_14: vcpu_guest_core_regs__bindgen_ty_14,
    pub __bindgen_anon_15: vcpu_guest_core_regs__bindgen_ty_15,
    pub __bindgen_anon_16: vcpu_guest_core_regs__bindgen_ty_16,
    pub __bindgen_anon_17: vcpu_guest_core_regs__bindgen_ty_17,
    pub __bindgen_anon_18: vcpu_guest_core_regs__bindgen_ty_18,
    pub __bindgen_anon_19: vcpu_guest_core_regs__bindgen_ty_19,
    pub __bindgen_anon_20: vcpu_guest_core_regs__bindgen_ty_20,
    pub __bindgen_anon_21: vcpu_guest_core_regs__bindgen_ty_21,
    pub __bindgen_anon_22: vcpu_guest_core_regs__bindgen_ty_22,
    pub __bindgen_anon_23: vcpu_guest_core_regs__bindgen_ty_23,
    pub __bindgen_anon_24: vcpu_guest_core_regs__bindgen_ty_24,
    pub __bindgen_anon_25: vcpu_guest_core_regs__bindgen_ty_25,
    pub __bindgen_anon_26: vcpu_guest_core_regs__bindgen_ty_26,
    pub __bindgen_anon_27: vcpu_guest_core_regs__bindgen_ty_27,
    pub __bindgen_anon_28: vcpu_guest_core_regs__bindgen_ty_28,
    pub __bindgen_anon_29: vcpu_guest_core_regs__bindgen_ty_29,
    pub __bindgen_anon_30: vcpu_guest_core_regs__bindgen_ty_30,
    pub __bindgen_anon_31: vcpu_guest_core_regs__bindgen_ty_31,
    pub __bindgen_anon_32: vcpu_guest_core_regs__bindgen_ty_32,
    pub cpsr: u64,
    pub __bindgen_anon_33: vcpu_guest_core_regs__bindgen_ty_33,
    pub spsr_fiq: u32,
    pub spsr_irq: u32,
    pub spsr_und: u32,
    pub spsr_abt: u32,
    pub sp_el0: u64,
    pub sp_el1: u64,
    pub elr_el1: u64,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union vcpu_guest_core_regs__bindgen_ty_1 {
    pub x0: u64,
    pub r0_usr: u32,
}
#[test]
fn bindgen_test_layout_vcpu_guest_core_regs__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<vcpu_guest_core_regs__bindgen_ty_1>(),
        8usize,
        concat!("Size of: ", stringify!(vcpu_guest_core_regs__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<vcpu_guest_core_regs__bindgen_ty_1>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(vcpu_guest_core_regs__bindgen_ty_1)
        )
    );
    fn test_field_x0() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<vcpu_guest_core_regs__bindgen_ty_1>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).x0) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(vcpu_guest_core_regs__bindgen_ty_1),
                "::",
                stringify!(x0)
            )
        );
    }
    test_field_x0();
    fn test_field_r0_usr() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<vcpu_guest_core_regs__bindgen_ty_1>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).r0_usr) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(vcpu_guest_core_regs__bindgen_ty_1),
                "::",
                stringify!(r0_usr)
            )
        );
    }
    test_field_r0_usr();
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union vcpu_guest_core_regs__bindgen_ty_2 {
    pub x1: u64,
    pub r1_usr: u32,
}
#[test]
fn bindgen_test_layout_vcpu_guest_core_regs__bindgen_ty_2() {
    assert_eq!(
        ::std::mem::size_of::<vcpu_guest_core_regs__bindgen_ty_2>(),
        8usize,
        concat!("Size of: ", stringify!(vcpu_guest_core_regs__bindgen_ty_2))
    );
    assert_eq!(
        ::std::mem::align_of::<vcpu_guest_core_regs__bindgen_ty_2>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(vcpu_guest_core_regs__bindgen_ty_2)
        )
    );
    fn test_field_x1() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<vcpu_guest_core_regs__bindgen_ty_2>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).x1) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(vcpu_guest_core_regs__bindgen_ty_2),
                "::",
                stringify!(x1)
            )
        );
    }
    test_field_x1();
    fn test_field_r1_usr() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<vcpu_guest_core_regs__bindgen_ty_2>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).r1_usr) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(vcpu_guest_core_regs__bindgen_ty_2),
                "::",
                stringify!(r1_usr)
            )
        );
    }
    test_field_r1_usr();
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union vcpu_guest_core_regs__bindgen_ty_3 {
    pub x2: u64,
    pub r2_usr: u32,
}
#[test]
fn bindgen_test_layout_vcpu_guest_core_regs__bindgen_ty_3() {
    assert_eq!(
        ::std::mem::size_of::<vcpu_guest_core_regs__bindgen_ty_3>(),
        8usize,
        concat!("Size of: ", stringify!(vcpu_guest_core_regs__bindgen_ty_3))
    );
    assert_eq!(
        ::std::mem::align_of::<vcpu_guest_core_regs__bindgen_ty_3>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(vcpu_guest_core_regs__bindgen_ty_3)
        )
    );
    fn test_field_x2() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<vcpu_guest_core_regs__bindgen_ty_3>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).x2) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(vcpu_guest_core_regs__bindgen_ty_3),
                "::",
                stringify!(x2)
            )
        );
    }
    test_field_x2();
    fn test_field_r2_usr() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<vcpu_guest_core_regs__bindgen_ty_3>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).r2_usr) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(vcpu_guest_core_regs__bindgen_ty_3),
                "::",
                stringify!(r2_usr)
            )
        );
    }
    test_field_r2_usr();
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union vcpu_guest_core_regs__bindgen_ty_4 {
    pub x3: u64,
    pub r3_usr: u32,
}
#[test]
fn bindgen_test_layout_vcpu_guest_core_regs__bindgen_ty_4() {
    assert_eq!(
        ::std::mem::size_of::<vcpu_guest_core_regs__bindgen_ty_4>(),
        8usize,
        concat!("Size of: ", stringify!(vcpu_guest_core_regs__bindgen_ty_4))
    );
    assert_eq!(
        ::std::mem::align_of::<vcpu_guest_core_regs__bindgen_ty_4>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(vcpu_guest_core_regs__bindgen_ty_4)
        )
    );
    fn test_field_x3() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<vcpu_guest_core_regs__bindgen_ty_4>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).x3) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(vcpu_guest_core_regs__bindgen_ty_4),
                "::",
                stringify!(x3)
            )
        );
    }
    test_field_x3();
    fn test_field_r3_usr() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<vcpu_guest_core_regs__bindgen_ty_4>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).r3_usr) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(vcpu_guest_core_regs__bindgen_ty_4),
                "::",
                stringify!(r3_usr)
            )
        );
    }
    test_field_r3_usr();
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union vcpu_guest_core_regs__bindgen_ty_5 {
    pub x4: u64,
    pub r4_usr: u32,
}
#[test]
fn bindgen_test_layout_vcpu_guest_core_regs__bindgen_ty_5() {
    assert_eq!(
        ::std::mem::size_of::<vcpu_guest_core_regs__bindgen_ty_5>(),
        8usize,
        concat!("Size of: ", stringify!(vcpu_guest_core_regs__bindgen_ty_5))
    );
    assert_eq!(
        ::std::mem::align_of::<vcpu_guest_core_regs__bindgen_ty_5>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(vcpu_guest_core_regs__bindgen_ty_5)
        )
    );
    fn test_field_x4() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<vcpu_guest_core_regs__bindgen_ty_5>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).x4) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(vcpu_guest_core_regs__bindgen_ty_5),
                "::",
                stringify!(x4)
            )
        );
    }
    test_field_x4();
    fn test_field_r4_usr() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<vcpu_guest_core_regs__bindgen_ty_5>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).r4_usr) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(vcpu_guest_core_regs__bindgen_ty_5),
                "::",
                stringify!(r4_usr)
            )
        );
    }
    test_field_r4_usr();
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union vcpu_guest_core_regs__bindgen_ty_6 {
    pub x5: u64,
    pub r5_usr: u32,
}
#[test]
fn bindgen_test_layout_vcpu_guest_core_regs__bindgen_ty_6() {
    assert_eq!(
        ::std::mem::size_of::<vcpu_guest_core_regs__bindgen_ty_6>(),
        8usize,
        concat!("Size of: ", stringify!(vcpu_guest_core_regs__bindgen_ty_6))
    );
    assert_eq!(
        ::std::mem::align_of::<vcpu_guest_core_regs__bindgen_ty_6>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(vcpu_guest_core_regs__bindgen_ty_6)
        )
    );
    fn test_field_x5() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<vcpu_guest_core_regs__bindgen_ty_6>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).x5) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(vcpu_guest_core_regs__bindgen_ty_6),
                "::",
                stringify!(x5)
            )
        );
    }
    test_field_x5();
    fn test_field_r5_usr() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<vcpu_guest_core_regs__bindgen_ty_6>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).r5_usr) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(vcpu_guest_core_regs__bindgen_ty_6),
                "::",
                stringify!(r5_usr)
            )
        );
    }
    test_field_r5_usr();
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union vcpu_guest_core_regs__bindgen_ty_7 {
    pub x6: u64,
    pub r6_usr: u32,
}
#[test]
fn bindgen_test_layout_vcpu_guest_core_regs__bindgen_ty_7() {
    assert_eq!(
        ::std::mem::size_of::<vcpu_guest_core_regs__bindgen_ty_7>(),
        8usize,
        concat!("Size of: ", stringify!(vcpu_guest_core_regs__bindgen_ty_7))
    );
    assert_eq!(
        ::std::mem::align_of::<vcpu_guest_core_regs__bindgen_ty_7>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(vcpu_guest_core_regs__bindgen_ty_7)
        )
    );
    fn test_field_x6() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<vcpu_guest_core_regs__bindgen_ty_7>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).x6) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(vcpu_guest_core_regs__bindgen_ty_7),
                "::",
                stringify!(x6)
            )
        );
    }
    test_field_x6();
    fn test_field_r6_usr() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<vcpu_guest_core_regs__bindgen_ty_7>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).r6_usr) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(vcpu_guest_core_regs__bindgen_ty_7),
                "::",
                stringify!(r6_usr)
            )
        );
    }
    test_field_r6_usr();
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union vcpu_guest_core_regs__bindgen_ty_8 {
    pub x7: u64,
    pub r7_usr: u32,
}
#[test]
fn bindgen_test_layout_vcpu_guest_core_regs__bindgen_ty_8() {
    assert_eq!(
        ::std::mem::size_of::<vcpu_guest_core_regs__bindgen_ty_8>(),
        8usize,
        concat!("Size of: ", stringify!(vcpu_guest_core_regs__bindgen_ty_8))
    );
    assert_eq!(
        ::std::mem::align_of::<vcpu_guest_core_regs__bindgen_ty_8>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(vcpu_guest_core_regs__bindgen_ty_8)
        )
    );
    fn test_field_x7() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<vcpu_guest_core_regs__bindgen_ty_8>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).x7) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(vcpu_guest_core_regs__bindgen_ty_8),
                "::",
                stringify!(x7)
            )
        );
    }
    test_field_x7();
    fn test_field_r7_usr() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<vcpu_guest_core_regs__bindgen_ty_8>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).r7_usr) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(vcpu_guest_core_regs__bindgen_ty_8),
                "::",
                stringify!(r7_usr)
            )
        );
    }
    test_field_r7_usr();
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union vcpu_guest_core_regs__bindgen_ty_9 {
    pub x8: u64,
    pub r8_usr: u32,
}
#[test]
fn bindgen_test_layout_vcpu_guest_core_regs__bindgen_ty_9() {
    assert_eq!(
        ::std::mem::size_of::<vcpu_guest_core_regs__bindgen_ty_9>(),
        8usize,
        concat!("Size of: ", stringify!(vcpu_guest_core_regs__bindgen_ty_9))
    );
    assert_eq!(
        ::std::mem::align_of::<vcpu_guest_core_regs__bindgen_ty_9>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(vcpu_guest_core_regs__bindgen_ty_9)
        )
    );
    fn test_field_x8() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<vcpu_guest_core_regs__bindgen_ty_9>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).x8) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(vcpu_guest_core_regs__bindgen_ty_9),
                "::",
                stringify!(x8)
            )
        );
    }
    test_field_x8();
    fn test_field_r8_usr() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<vcpu_guest_core_regs__bindgen_ty_9>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).r8_usr) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(vcpu_guest_core_regs__bindgen_ty_9),
                "::",
                stringify!(r8_usr)
            )
        );
    }
    test_field_r8_usr();
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union vcpu_guest_core_regs__bindgen_ty_10 {
    pub x9: u64,
    pub r9_usr: u32,
}
#[test]
fn bindgen_test_layout_vcpu_guest_core_regs__bindgen_ty_10() {
    assert_eq!(
        ::std::mem::size_of::<vcpu_guest_core_regs__bindgen_ty_10>(),
        8usize,
        concat!("Size of: ", stringify!(vcpu_guest_core_regs__bindgen_ty_10))
    );
    assert_eq!(
        ::std::mem::align_of::<vcpu_guest_core_regs__bindgen_ty_10>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(vcpu_guest_core_regs__bindgen_ty_10)
        )
    );
    fn test_field_x9() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<vcpu_guest_core_regs__bindgen_ty_10>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).x9) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(vcpu_guest_core_regs__bindgen_ty_10),
                "::",
                stringify!(x9)
            )
        );
    }
    test_field_x9();
    fn test_field_r9_usr() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<vcpu_guest_core_regs__bindgen_ty_10>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).r9_usr) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(vcpu_guest_core_regs__bindgen_ty_10),
                "::",
                stringify!(r9_usr)
            )
        );
    }
    test_field_r9_usr();
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union vcpu_guest_core_regs__bindgen_ty_11 {
    pub x10: u64,
    pub r10_usr: u32,
}
#[test]
fn bindgen_test_layout_vcpu_guest_core_regs__bindgen_ty_11() {
    assert_eq!(
        ::std::mem::size_of::<vcpu_guest_core_regs__bindgen_ty_11>(),
        8usize,
        concat!("Size of: ", stringify!(vcpu_guest_core_regs__bindgen_ty_11))
    );
    assert_eq!(
        ::std::mem::align_of::<vcpu_guest_core_regs__bindgen_ty_11>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(vcpu_guest_core_regs__bindgen_ty_11)
        )
    );
    fn test_field_x10() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<vcpu_guest_core_regs__bindgen_ty_11>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).x10) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(vcpu_guest_core_regs__bindgen_ty_11),
                "::",
                stringify!(x10)
            )
        );
    }
    test_field_x10();
    fn test_field_r10_usr() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<vcpu_guest_core_regs__bindgen_ty_11>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).r10_usr) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(vcpu_guest_core_regs__bindgen_ty_11),
                "::",
                stringify!(r10_usr)
            )
        );
    }
    test_field_r10_usr();
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union vcpu_guest_core_regs__bindgen_ty_12 {
    pub x11: u64,
    pub r11_usr: u32,
}
#[test]
fn bindgen_test_layout_vcpu_guest_core_regs__bindgen_ty_12() {
    assert_eq!(
        ::std::mem::size_of::<vcpu_guest_core_regs__bindgen_ty_12>(),
        8usize,
        concat!("Size of: ", stringify!(vcpu_guest_core_regs__bindgen_ty_12))
    );
    assert_eq!(
        ::std::mem::align_of::<vcpu_guest_core_regs__bindgen_ty_12>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(vcpu_guest_core_regs__bindgen_ty_12)
        )
    );
    fn test_field_x11() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<vcpu_guest_core_regs__bindgen_ty_12>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).x11) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(vcpu_guest_core_regs__bindgen_ty_12),
                "::",
                stringify!(x11)
            )
        );
    }
    test_field_x11();
    fn test_field_r11_usr() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<vcpu_guest_core_regs__bindgen_ty_12>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).r11_usr) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(vcpu_guest_core_regs__bindgen_ty_12),
                "::",
                stringify!(r11_usr)
            )
        );
    }
    test_field_r11_usr();
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union vcpu_guest_core_regs__bindgen_ty_13 {
    pub x12: u64,
    pub r12_usr: u32,
}
#[test]
fn bindgen_test_layout_vcpu_guest_core_regs__bindgen_ty_13() {
    assert_eq!(
        ::std::mem::size_of::<vcpu_guest_core_regs__bindgen_ty_13>(),
        8usize,
        concat!("Size of: ", stringify!(vcpu_guest_core_regs__bindgen_ty_13))
    );
    assert_eq!(
        ::std::mem::align_of::<vcpu_guest_core_regs__bindgen_ty_13>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(vcpu_guest_core_regs__bindgen_ty_13)
        )
    );
    fn test_field_x12() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<vcpu_guest_core_regs__bindgen_ty_13>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).x12) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(vcpu_guest_core_regs__bindgen_ty_13),
                "::",
                stringify!(x12)
            )
        );
    }
    test_field_x12();
    fn test_field_r12_usr() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<vcpu_guest_core_regs__bindgen_ty_13>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).r12_usr) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(vcpu_guest_core_regs__bindgen_ty_13),
                "::",
                stringify!(r12_usr)
            )
        );
    }
    test_field_r12_usr();
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union vcpu_guest_core_regs__bindgen_ty_14 {
    pub x13: u64,
    pub sp_usr: u32,
}
#[test]
fn bindgen_test_layout_vcpu_guest_core_regs__bindgen_ty_14() {
    assert_eq!(
        ::std::mem::size_of::<vcpu_guest_core_regs__bindgen_ty_14>(),
        8usize,
        concat!("Size of: ", stringify!(vcpu_guest_core_regs__bindgen_ty_14))
    );
    assert_eq!(
        ::std::mem::align_of::<vcpu_guest_core_regs__bindgen_ty_14>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(vcpu_guest_core_regs__bindgen_ty_14)
        )
    );
    fn test_field_x13() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<vcpu_guest_core_regs__bindgen_ty_14>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).x13) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(vcpu_guest_core_regs__bindgen_ty_14),
                "::",
                stringify!(x13)
            )
        );
    }
    test_field_x13();
    fn test_field_sp_usr() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<vcpu_guest_core_regs__bindgen_ty_14>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).sp_usr) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(vcpu_guest_core_regs__bindgen_ty_14),
                "::",
                stringify!(sp_usr)
            )
        );
    }
    test_field_sp_usr();
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union vcpu_guest_core_regs__bindgen_ty_15 {
    pub x14: u64,
    pub lr_usr: u32,
}
#[test]
fn bindgen_test_layout_vcpu_guest_core_regs__bindgen_ty_15() {
    assert_eq!(
        ::std::mem::size_of::<vcpu_guest_core_regs__bindgen_ty_15>(),
        8usize,
        concat!("Size of: ", stringify!(vcpu_guest_core_regs__bindgen_ty_15))
    );
    assert_eq!(
        ::std::mem::align_of::<vcpu_guest_core_regs__bindgen_ty_15>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(vcpu_guest_core_regs__bindgen_ty_15)
        )
    );
    fn test_field_x14() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<vcpu_guest_core_regs__bindgen_ty_15>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).x14) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(vcpu_guest_core_regs__bindgen_ty_15),
                "::",
                stringify!(x14)
            )
        );
    }
    test_field_x14();
    fn test_field_lr_usr() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<vcpu_guest_core_regs__bindgen_ty_15>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).lr_usr) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(vcpu_guest_core_regs__bindgen_ty_15),
                "::",
                stringify!(lr_usr)
            )
        );
    }
    test_field_lr_usr();
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union vcpu_guest_core_regs__bindgen_ty_16 {
    pub x15: u64,
    pub __unused_sp_hyp: u32,
}
#[test]
fn bindgen_test_layout_vcpu_guest_core_regs__bindgen_ty_16() {
    assert_eq!(
        ::std::mem::size_of::<vcpu_guest_core_regs__bindgen_ty_16>(),
        8usize,
        concat!("Size of: ", stringify!(vcpu_guest_core_regs__bindgen_ty_16))
    );
    assert_eq!(
        ::std::mem::align_of::<vcpu_guest_core_regs__bindgen_ty_16>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(vcpu_guest_core_regs__bindgen_ty_16)
        )
    );
    fn test_field_x15() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<vcpu_guest_core_regs__bindgen_ty_16>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).x15) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(vcpu_guest_core_regs__bindgen_ty_16),
                "::",
                stringify!(x15)
            )
        );
    }
    test_field_x15();
    fn test_field___unused_sp_hyp() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<vcpu_guest_core_regs__bindgen_ty_16>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__unused_sp_hyp) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(vcpu_guest_core_regs__bindgen_ty_16),
                "::",
                stringify!(__unused_sp_hyp)
            )
        );
    }
    test_field___unused_sp_hyp();
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union vcpu_guest_core_regs__bindgen_ty_17 {
    pub x16: u64,
    pub lr_irq: u32,
}
#[test]
fn bindgen_test_layout_vcpu_guest_core_regs__bindgen_ty_17() {
    assert_eq!(
        ::std::mem::size_of::<vcpu_guest_core_regs__bindgen_ty_17>(),
        8usize,
        concat!("Size of: ", stringify!(vcpu_guest_core_regs__bindgen_ty_17))
    );
    assert_eq!(
        ::std::mem::align_of::<vcpu_guest_core_regs__bindgen_ty_17>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(vcpu_guest_core_regs__bindgen_ty_17)
        )
    );
    fn test_field_x16() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<vcpu_guest_core_regs__bindgen_ty_17>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).x16) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(vcpu_guest_core_regs__bindgen_ty_17),
                "::",
                stringify!(x16)
            )
        );
    }
    test_field_x16();
    fn test_field_lr_irq() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<vcpu_guest_core_regs__bindgen_ty_17>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).lr_irq) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(vcpu_guest_core_regs__bindgen_ty_17),
                "::",
                stringify!(lr_irq)
            )
        );
    }
    test_field_lr_irq();
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union vcpu_guest_core_regs__bindgen_ty_18 {
    pub x17: u64,
    pub sp_irq: u32,
}
#[test]
fn bindgen_test_layout_vcpu_guest_core_regs__bindgen_ty_18() {
    assert_eq!(
        ::std::mem::size_of::<vcpu_guest_core_regs__bindgen_ty_18>(),
        8usize,
        concat!("Size of: ", stringify!(vcpu_guest_core_regs__bindgen_ty_18))
    );
    assert_eq!(
        ::std::mem::align_of::<vcpu_guest_core_regs__bindgen_ty_18>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(vcpu_guest_core_regs__bindgen_ty_18)
        )
    );
    fn test_field_x17() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<vcpu_guest_core_regs__bindgen_ty_18>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).x17) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(vcpu_guest_core_regs__bindgen_ty_18),
                "::",
                stringify!(x17)
            )
        );
    }
    test_field_x17();
    fn test_field_sp_irq() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<vcpu_guest_core_regs__bindgen_ty_18>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).sp_irq) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(vcpu_guest_core_regs__bindgen_ty_18),
                "::",
                stringify!(sp_irq)
            )
        );
    }
    test_field_sp_irq();
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union vcpu_guest_core_regs__bindgen_ty_19 {
    pub x18: u64,
    pub lr_svc: u32,
}
#[test]
fn bindgen_test_layout_vcpu_guest_core_regs__bindgen_ty_19() {
    assert_eq!(
        ::std::mem::size_of::<vcpu_guest_core_regs__bindgen_ty_19>(),
        8usize,
        concat!("Size of: ", stringify!(vcpu_guest_core_regs__bindgen_ty_19))
    );
    assert_eq!(
        ::std::mem::align_of::<vcpu_guest_core_regs__bindgen_ty_19>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(vcpu_guest_core_regs__bindgen_ty_19)
        )
    );
    fn test_field_x18() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<vcpu_guest_core_regs__bindgen_ty_19>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).x18) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(vcpu_guest_core_regs__bindgen_ty_19),
                "::",
                stringify!(x18)
            )
        );
    }
    test_field_x18();
    fn test_field_lr_svc() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<vcpu_guest_core_regs__bindgen_ty_19>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).lr_svc) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(vcpu_guest_core_regs__bindgen_ty_19),
                "::",
                stringify!(lr_svc)
            )
        );
    }
    test_field_lr_svc();
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union vcpu_guest_core_regs__bindgen_ty_20 {
    pub x19: u64,
    pub sp_svc: u32,
}
#[test]
fn bindgen_test_layout_vcpu_guest_core_regs__bindgen_ty_20() {
    assert_eq!(
        ::std::mem::size_of::<vcpu_guest_core_regs__bindgen_ty_20>(),
        8usize,
        concat!("Size of: ", stringify!(vcpu_guest_core_regs__bindgen_ty_20))
    );
    assert_eq!(
        ::std::mem::align_of::<vcpu_guest_core_regs__bindgen_ty_20>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(vcpu_guest_core_regs__bindgen_ty_20)
        )
    );
    fn test_field_x19() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<vcpu_guest_core_regs__bindgen_ty_20>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).x19) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(vcpu_guest_core_regs__bindgen_ty_20),
                "::",
                stringify!(x19)
            )
        );
    }
    test_field_x19();
    fn test_field_sp_svc() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<vcpu_guest_core_regs__bindgen_ty_20>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).sp_svc) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(vcpu_guest_core_regs__bindgen_ty_20),
                "::",
                stringify!(sp_svc)
            )
        );
    }
    test_field_sp_svc();
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union vcpu_guest_core_regs__bindgen_ty_21 {
    pub x20: u64,
    pub lr_abt: u32,
}
#[test]
fn bindgen_test_layout_vcpu_guest_core_regs__bindgen_ty_21() {
    assert_eq!(
        ::std::mem::size_of::<vcpu_guest_core_regs__bindgen_ty_21>(),
        8usize,
        concat!("Size of: ", stringify!(vcpu_guest_core_regs__bindgen_ty_21))
    );
    assert_eq!(
        ::std::mem::align_of::<vcpu_guest_core_regs__bindgen_ty_21>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(vcpu_guest_core_regs__bindgen_ty_21)
        )
    );
    fn test_field_x20() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<vcpu_guest_core_regs__bindgen_ty_21>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).x20) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(vcpu_guest_core_regs__bindgen_ty_21),
                "::",
                stringify!(x20)
            )
        );
    }
    test_field_x20();
    fn test_field_lr_abt() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<vcpu_guest_core_regs__bindgen_ty_21>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).lr_abt) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(vcpu_guest_core_regs__bindgen_ty_21),
                "::",
                stringify!(lr_abt)
            )
        );
    }
    test_field_lr_abt();
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union vcpu_guest_core_regs__bindgen_ty_22 {
    pub x21: u64,
    pub sp_abt: u32,
}
#[test]
fn bindgen_test_layout_vcpu_guest_core_regs__bindgen_ty_22() {
    assert_eq!(
        ::std::mem::size_of::<vcpu_guest_core_regs__bindgen_ty_22>(),
        8usize,
        concat!("Size of: ", stringify!(vcpu_guest_core_regs__bindgen_ty_22))
    );
    assert_eq!(
        ::std::mem::align_of::<vcpu_guest_core_regs__bindgen_ty_22>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(vcpu_guest_core_regs__bindgen_ty_22)
        )
    );
    fn test_field_x21() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<vcpu_guest_core_regs__bindgen_ty_22>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).x21) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(vcpu_guest_core_regs__bindgen_ty_22),
                "::",
                stringify!(x21)
            )
        );
    }
    test_field_x21();
    fn test_field_sp_abt() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<vcpu_guest_core_regs__bindgen_ty_22>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).sp_abt) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(vcpu_guest_core_regs__bindgen_ty_22),
                "::",
                stringify!(sp_abt)
            )
        );
    }
    test_field_sp_abt();
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union vcpu_guest_core_regs__bindgen_ty_23 {
    pub x22: u64,
    pub lr_und: u32,
}
#[test]
fn bindgen_test_layout_vcpu_guest_core_regs__bindgen_ty_23() {
    assert_eq!(
        ::std::mem::size_of::<vcpu_guest_core_regs__bindgen_ty_23>(),
        8usize,
        concat!("Size of: ", stringify!(vcpu_guest_core_regs__bindgen_ty_23))
    );
    assert_eq!(
        ::std::mem::align_of::<vcpu_guest_core_regs__bindgen_ty_23>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(vcpu_guest_core_regs__bindgen_ty_23)
        )
    );
    fn test_field_x22() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<vcpu_guest_core_regs__bindgen_ty_23>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).x22) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(vcpu_guest_core_regs__bindgen_ty_23),
                "::",
                stringify!(x22)
            )
        );
    }
    test_field_x22();
    fn test_field_lr_und() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<vcpu_guest_core_regs__bindgen_ty_23>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).lr_und) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(vcpu_guest_core_regs__bindgen_ty_23),
                "::",
                stringify!(lr_und)
            )
        );
    }
    test_field_lr_und();
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union vcpu_guest_core_regs__bindgen_ty_24 {
    pub x23: u64,
    pub sp_und: u32,
}
#[test]
fn bindgen_test_layout_vcpu_guest_core_regs__bindgen_ty_24() {
    assert_eq!(
        ::std::mem::size_of::<vcpu_guest_core_regs__bindgen_ty_24>(),
        8usize,
        concat!("Size of: ", stringify!(vcpu_guest_core_regs__bindgen_ty_24))
    );
    assert_eq!(
        ::std::mem::align_of::<vcpu_guest_core_regs__bindgen_ty_24>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(vcpu_guest_core_regs__bindgen_ty_24)
        )
    );
    fn test_field_x23() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<vcpu_guest_core_regs__bindgen_ty_24>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).x23) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(vcpu_guest_core_regs__bindgen_ty_24),
                "::",
                stringify!(x23)
            )
        );
    }
    test_field_x23();
    fn test_field_sp_und() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<vcpu_guest_core_regs__bindgen_ty_24>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).sp_und) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(vcpu_guest_core_regs__bindgen_ty_24),
                "::",
                stringify!(sp_und)
            )
        );
    }
    test_field_sp_und();
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union vcpu_guest_core_regs__bindgen_ty_25 {
    pub x24: u64,
    pub r8_fiq: u32,
}
#[test]
fn bindgen_test_layout_vcpu_guest_core_regs__bindgen_ty_25() {
    assert_eq!(
        ::std::mem::size_of::<vcpu_guest_core_regs__bindgen_ty_25>(),
        8usize,
        concat!("Size of: ", stringify!(vcpu_guest_core_regs__bindgen_ty_25))
    );
    assert_eq!(
        ::std::mem::align_of::<vcpu_guest_core_regs__bindgen_ty_25>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(vcpu_guest_core_regs__bindgen_ty_25)
        )
    );
    fn test_field_x24() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<vcpu_guest_core_regs__bindgen_ty_25>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).x24) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(vcpu_guest_core_regs__bindgen_ty_25),
                "::",
                stringify!(x24)
            )
        );
    }
    test_field_x24();
    fn test_field_r8_fiq() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<vcpu_guest_core_regs__bindgen_ty_25>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).r8_fiq) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(vcpu_guest_core_regs__bindgen_ty_25),
                "::",
                stringify!(r8_fiq)
            )
        );
    }
    test_field_r8_fiq();
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union vcpu_guest_core_regs__bindgen_ty_26 {
    pub x25: u64,
    pub r9_fiq: u32,
}
#[test]
fn bindgen_test_layout_vcpu_guest_core_regs__bindgen_ty_26() {
    assert_eq!(
        ::std::mem::size_of::<vcpu_guest_core_regs__bindgen_ty_26>(),
        8usize,
        concat!("Size of: ", stringify!(vcpu_guest_core_regs__bindgen_ty_26))
    );
    assert_eq!(
        ::std::mem::align_of::<vcpu_guest_core_regs__bindgen_ty_26>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(vcpu_guest_core_regs__bindgen_ty_26)
        )
    );
    fn test_field_x25() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<vcpu_guest_core_regs__bindgen_ty_26>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).x25) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(vcpu_guest_core_regs__bindgen_ty_26),
                "::",
                stringify!(x25)
            )
        );
    }
    test_field_x25();
    fn test_field_r9_fiq() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<vcpu_guest_core_regs__bindgen_ty_26>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).r9_fiq) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(vcpu_guest_core_regs__bindgen_ty_26),
                "::",
                stringify!(r9_fiq)
            )
        );
    }
    test_field_r9_fiq();
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union vcpu_guest_core_regs__bindgen_ty_27 {
    pub x26: u64,
    pub r10_fiq: u32,
}
#[test]
fn bindgen_test_layout_vcpu_guest_core_regs__bindgen_ty_27() {
    assert_eq!(
        ::std::mem::size_of::<vcpu_guest_core_regs__bindgen_ty_27>(),
        8usize,
        concat!("Size of: ", stringify!(vcpu_guest_core_regs__bindgen_ty_27))
    );
    assert_eq!(
        ::std::mem::align_of::<vcpu_guest_core_regs__bindgen_ty_27>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(vcpu_guest_core_regs__bindgen_ty_27)
        )
    );
    fn test_field_x26() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<vcpu_guest_core_regs__bindgen_ty_27>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).x26) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(vcpu_guest_core_regs__bindgen_ty_27),
                "::",
                stringify!(x26)
            )
        );
    }
    test_field_x26();
    fn test_field_r10_fiq() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<vcpu_guest_core_regs__bindgen_ty_27>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).r10_fiq) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(vcpu_guest_core_regs__bindgen_ty_27),
                "::",
                stringify!(r10_fiq)
            )
        );
    }
    test_field_r10_fiq();
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union vcpu_guest_core_regs__bindgen_ty_28 {
    pub x27: u64,
    pub r11_fiq: u32,
}
#[test]
fn bindgen_test_layout_vcpu_guest_core_regs__bindgen_ty_28() {
    assert_eq!(
        ::std::mem::size_of::<vcpu_guest_core_regs__bindgen_ty_28>(),
        8usize,
        concat!("Size of: ", stringify!(vcpu_guest_core_regs__bindgen_ty_28))
    );
    assert_eq!(
        ::std::mem::align_of::<vcpu_guest_core_regs__bindgen_ty_28>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(vcpu_guest_core_regs__bindgen_ty_28)
        )
    );
    fn test_field_x27() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<vcpu_guest_core_regs__bindgen_ty_28>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).x27) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(vcpu_guest_core_regs__bindgen_ty_28),
                "::",
                stringify!(x27)
            )
        );
    }
    test_field_x27();
    fn test_field_r11_fiq() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<vcpu_guest_core_regs__bindgen_ty_28>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).r11_fiq) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(vcpu_guest_core_regs__bindgen_ty_28),
                "::",
                stringify!(r11_fiq)
            )
        );
    }
    test_field_r11_fiq();
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union vcpu_guest_core_regs__bindgen_ty_29 {
    pub x28: u64,
    pub r12_fiq: u32,
}
#[test]
fn bindgen_test_layout_vcpu_guest_core_regs__bindgen_ty_29() {
    assert_eq!(
        ::std::mem::size_of::<vcpu_guest_core_regs__bindgen_ty_29>(),
        8usize,
        concat!("Size of: ", stringify!(vcpu_guest_core_regs__bindgen_ty_29))
    );
    assert_eq!(
        ::std::mem::align_of::<vcpu_guest_core_regs__bindgen_ty_29>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(vcpu_guest_core_regs__bindgen_ty_29)
        )
    );
    fn test_field_x28() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<vcpu_guest_core_regs__bindgen_ty_29>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).x28) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(vcpu_guest_core_regs__bindgen_ty_29),
                "::",
                stringify!(x28)
            )
        );
    }
    test_field_x28();
    fn test_field_r12_fiq() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<vcpu_guest_core_regs__bindgen_ty_29>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).r12_fiq) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(vcpu_guest_core_regs__bindgen_ty_29),
                "::",
                stringify!(r12_fiq)
            )
        );
    }
    test_field_r12_fiq();
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union vcpu_guest_core_regs__bindgen_ty_30 {
    pub x29: u64,
    pub sp_fiq: u32,
}
#[test]
fn bindgen_test_layout_vcpu_guest_core_regs__bindgen_ty_30() {
    assert_eq!(
        ::std::mem::size_of::<vcpu_guest_core_regs__bindgen_ty_30>(),
        8usize,
        concat!("Size of: ", stringify!(vcpu_guest_core_regs__bindgen_ty_30))
    );
    assert_eq!(
        ::std::mem::align_of::<vcpu_guest_core_regs__bindgen_ty_30>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(vcpu_guest_core_regs__bindgen_ty_30)
        )
    );
    fn test_field_x29() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<vcpu_guest_core_regs__bindgen_ty_30>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).x29) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(vcpu_guest_core_regs__bindgen_ty_30),
                "::",
                stringify!(x29)
            )
        );
    }
    test_field_x29();
    fn test_field_sp_fiq() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<vcpu_guest_core_regs__bindgen_ty_30>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).sp_fiq) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(vcpu_guest_core_regs__bindgen_ty_30),
                "::",
                stringify!(sp_fiq)
            )
        );
    }
    test_field_sp_fiq();
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union vcpu_guest_core_regs__bindgen_ty_31 {
    pub x30: u64,
    pub lr_fiq: u32,
}
#[test]
fn bindgen_test_layout_vcpu_guest_core_regs__bindgen_ty_31() {
    assert_eq!(
        ::std::mem::size_of::<vcpu_guest_core_regs__bindgen_ty_31>(),
        8usize,
        concat!("Size of: ", stringify!(vcpu_guest_core_regs__bindgen_ty_31))
    );
    assert_eq!(
        ::std::mem::align_of::<vcpu_guest_core_regs__bindgen_ty_31>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(vcpu_guest_core_regs__bindgen_ty_31)
        )
    );
    fn test_field_x30() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<vcpu_guest_core_regs__bindgen_ty_31>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).x30) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(vcpu_guest_core_regs__bindgen_ty_31),
                "::",
                stringify!(x30)
            )
        );
    }
    test_field_x30();
    fn test_field_lr_fiq() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<vcpu_guest_core_regs__bindgen_ty_31>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).lr_fiq) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(vcpu_guest_core_regs__bindgen_ty_31),
                "::",
                stringify!(lr_fiq)
            )
        );
    }
    test_field_lr_fiq();
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union vcpu_guest_core_regs__bindgen_ty_32 {
    pub pc64: u64,
    pub pc32: u32,
}
#[test]
fn bindgen_test_layout_vcpu_guest_core_regs__bindgen_ty_32() {
    assert_eq!(
        ::std::mem::size_of::<vcpu_guest_core_regs__bindgen_ty_32>(),
        8usize,
        concat!("Size of: ", stringify!(vcpu_guest_core_regs__bindgen_ty_32))
    );
    assert_eq!(
        ::std::mem::align_of::<vcpu_guest_core_regs__bindgen_ty_32>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(vcpu_guest_core_regs__bindgen_ty_32)
        )
    );
    fn test_field_pc64() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<vcpu_guest_core_regs__bindgen_ty_32>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).pc64) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(vcpu_guest_core_regs__bindgen_ty_32),
                "::",
                stringify!(pc64)
            )
        );
    }
    test_field_pc64();
    fn test_field_pc32() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<vcpu_guest_core_regs__bindgen_ty_32>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).pc32) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(vcpu_guest_core_regs__bindgen_ty_32),
                "::",
                stringify!(pc32)
            )
        );
    }
    test_field_pc32();
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union vcpu_guest_core_regs__bindgen_ty_33 {
    pub spsr_el1: u64,
    pub spsr_svc: u32,
}
#[test]
fn bindgen_test_layout_vcpu_guest_core_regs__bindgen_ty_33() {
    assert_eq!(
        ::std::mem::size_of::<vcpu_guest_core_regs__bindgen_ty_33>(),
        8usize,
        concat!("Size of: ", stringify!(vcpu_guest_core_regs__bindgen_ty_33))
    );
    assert_eq!(
        ::std::mem::align_of::<vcpu_guest_core_regs__bindgen_ty_33>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(vcpu_guest_core_regs__bindgen_ty_33)
        )
    );
    fn test_field_spsr_el1() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<vcpu_guest_core_regs__bindgen_ty_33>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).spsr_el1) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(vcpu_guest_core_regs__bindgen_ty_33),
                "::",
                stringify!(spsr_el1)
            )
        );
    }
    test_field_spsr_el1();
    fn test_field_spsr_svc() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<vcpu_guest_core_regs__bindgen_ty_33>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).spsr_svc) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(vcpu_guest_core_regs__bindgen_ty_33),
                "::",
                stringify!(spsr_svc)
            )
        );
    }
    test_field_spsr_svc();
}
#[test]
fn bindgen_test_layout_vcpu_guest_core_regs() {
    assert_eq!(
        ::std::mem::size_of::<vcpu_guest_core_regs>(),
        312usize,
        concat!("Size of: ", stringify!(vcpu_guest_core_regs))
    );
    assert_eq!(
        ::std::mem::align_of::<vcpu_guest_core_regs>(),
        8usize,
        concat!("Alignment of ", stringify!(vcpu_guest_core_regs))
    );
    fn test_field_cpsr() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<vcpu_guest_core_regs>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).cpsr) as usize - ptr as usize
            },
            256usize,
            concat!(
                "Offset of field: ",
                stringify!(vcpu_guest_core_regs),
                "::",
                stringify!(cpsr)
            )
        );
    }
    test_field_cpsr();
    fn test_field_spsr_fiq() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<vcpu_guest_core_regs>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).spsr_fiq) as usize - ptr as usize
            },
            272usize,
            concat!(
                "Offset of field: ",
                stringify!(vcpu_guest_core_regs),
                "::",
                stringify!(spsr_fiq)
            )
        );
    }
    test_field_spsr_fiq();
    fn test_field_spsr_irq() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<vcpu_guest_core_regs>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).spsr_irq) as usize - ptr as usize
            },
            276usize,
            concat!(
                "Offset of field: ",
                stringify!(vcpu_guest_core_regs),
                "::",
                stringify!(spsr_irq)
            )
        );
    }
    test_field_spsr_irq();
    fn test_field_spsr_und() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<vcpu_guest_core_regs>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).spsr_und) as usize - ptr as usize
            },
            280usize,
            concat!(
                "Offset of field: ",
                stringify!(vcpu_guest_core_regs),
                "::",
                stringify!(spsr_und)
            )
        );
    }
    test_field_spsr_und();
    fn test_field_spsr_abt() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<vcpu_guest_core_regs>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).spsr_abt) as usize - ptr as usize
            },
            284usize,
            concat!(
                "Offset of field: ",
                stringify!(vcpu_guest_core_regs),
                "::",
                stringify!(spsr_abt)
            )
        );
    }
    test_field_spsr_abt();
    fn test_field_sp_el0() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<vcpu_guest_core_regs>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).sp_el0) as usize - ptr as usize
            },
            288usize,
            concat!(
                "Offset of field: ",
                stringify!(vcpu_guest_core_regs),
                "::",
                stringify!(sp_el0)
            )
        );
    }
    test_field_sp_el0();
    fn test_field_sp_el1() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<vcpu_guest_core_regs>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).sp_el1) as usize - ptr as usize
            },
            296usize,
            concat!(
                "Offset of field: ",
                stringify!(vcpu_guest_core_regs),
                "::",
                stringify!(sp_el1)
            )
        );
    }
    test_field_sp_el1();
    fn test_field_elr_el1() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<vcpu_guest_core_regs>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).elr_el1) as usize - ptr as usize
            },
            304usize,
            concat!(
                "Offset of field: ",
                stringify!(vcpu_guest_core_regs),
                "::",
                stringify!(elr_el1)
            )
        );
    }
    test_field_elr_el1();
}
pub type vcpu_guest_core_regs_t = vcpu_guest_core_regs;
#[repr(C)]
#[derive(Copy, Clone)]
pub union __guest_handle_vcpu_guest_core_regs_t {
    pub p: *mut vcpu_guest_core_regs_t,
    pub q: ::std::os::raw::c_ulong,
}
#[test]
fn bindgen_test_layout___guest_handle_vcpu_guest_core_regs_t() {
    assert_eq!(
        ::std::mem::size_of::<__guest_handle_vcpu_guest_core_regs_t>(),
        8usize,
        concat!(
            "Size of: ",
            stringify!(__guest_handle_vcpu_guest_core_regs_t)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<__guest_handle_vcpu_guest_core_regs_t>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(__guest_handle_vcpu_guest_core_regs_t)
        )
    );
    fn test_field_p() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<__guest_handle_vcpu_guest_core_regs_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).p) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(__guest_handle_vcpu_guest_core_regs_t),
                "::",
                stringify!(p)
            )
        );
    }
    test_field_p();
    fn test_field_q() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<__guest_handle_vcpu_guest_core_regs_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).q) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(__guest_handle_vcpu_guest_core_regs_t),
                "::",
                stringify!(q)
            )
        );
    }
    test_field_q();
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union __guest_handle_64_vcpu_guest_core_regs_t {
    pub p: *mut vcpu_guest_core_regs_t,
    pub q: u64,
}
#[test]
fn bindgen_test_layout___guest_handle_64_vcpu_guest_core_regs_t() {
    assert_eq!(
        ::std::mem::size_of::<__guest_handle_64_vcpu_guest_core_regs_t>(),
        8usize,
        concat!(
            "Size of: ",
            stringify!(__guest_handle_64_vcpu_guest_core_regs_t)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<__guest_handle_64_vcpu_guest_core_regs_t>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(__guest_handle_64_vcpu_guest_core_regs_t)
        )
    );
    fn test_field_p() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<__guest_handle_64_vcpu_guest_core_regs_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).p) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(__guest_handle_64_vcpu_guest_core_regs_t),
                "::",
                stringify!(p)
            )
        );
    }
    test_field_p();
    fn test_field_q() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<__guest_handle_64_vcpu_guest_core_regs_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).q) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(__guest_handle_64_vcpu_guest_core_regs_t),
                "::",
                stringify!(q)
            )
        );
    }
    test_field_q();
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union __guest_handle_const_vcpu_guest_core_regs_t {
    pub p: *const vcpu_guest_core_regs_t,
    pub q: ::std::os::raw::c_ulong,
}
#[test]
fn bindgen_test_layout___guest_handle_const_vcpu_guest_core_regs_t() {
    assert_eq!(
        ::std::mem::size_of::<__guest_handle_const_vcpu_guest_core_regs_t>(),
        8usize,
        concat!(
            "Size of: ",
            stringify!(__guest_handle_const_vcpu_guest_core_regs_t)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<__guest_handle_const_vcpu_guest_core_regs_t>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(__guest_handle_const_vcpu_guest_core_regs_t)
        )
    );
    fn test_field_p() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<__guest_handle_const_vcpu_guest_core_regs_t>::uninit(
                    );
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).p) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(__guest_handle_const_vcpu_guest_core_regs_t),
                "::",
                stringify!(p)
            )
        );
    }
    test_field_p();
    fn test_field_q() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<__guest_handle_const_vcpu_guest_core_regs_t>::uninit(
                    );
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).q) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(__guest_handle_const_vcpu_guest_core_regs_t),
                "::",
                stringify!(q)
            )
        );
    }
    test_field_q();
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union __guest_handle_64_const_vcpu_guest_core_regs_t {
    pub p: *const vcpu_guest_core_regs_t,
    pub q: u64,
}
#[test]
fn bindgen_test_layout___guest_handle_64_const_vcpu_guest_core_regs_t() {
    assert_eq!(
        ::std::mem::size_of::<__guest_handle_64_const_vcpu_guest_core_regs_t>(),
        8usize,
        concat!(
            "Size of: ",
            stringify!(__guest_handle_64_const_vcpu_guest_core_regs_t)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<__guest_handle_64_const_vcpu_guest_core_regs_t>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(__guest_handle_64_const_vcpu_guest_core_regs_t)
        )
    );
    fn test_field_p() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<
                    __guest_handle_64_const_vcpu_guest_core_regs_t,
                >::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).p) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(__guest_handle_64_const_vcpu_guest_core_regs_t),
                "::",
                stringify!(p)
            )
        );
    }
    test_field_p();
    fn test_field_q() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<
                    __guest_handle_64_const_vcpu_guest_core_regs_t,
                >::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).q) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(__guest_handle_64_const_vcpu_guest_core_regs_t),
                "::",
                stringify!(q)
            )
        );
    }
    test_field_q();
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct vcpu_guest_context {
    pub flags: u32,
    pub user_regs: vcpu_guest_core_regs,
    pub sctlr: u64,
    pub ttbcr: u64,
    pub ttbr0: u64,
    pub ttbr1: u64,
}
#[test]
fn bindgen_test_layout_vcpu_guest_context() {
    assert_eq!(
        ::std::mem::size_of::<vcpu_guest_context>(),
        352usize,
        concat!("Size of: ", stringify!(vcpu_guest_context))
    );
    assert_eq!(
        ::std::mem::align_of::<vcpu_guest_context>(),
        8usize,
        concat!("Alignment of ", stringify!(vcpu_guest_context))
    );
    fn test_field_flags() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<vcpu_guest_context>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).flags) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(vcpu_guest_context),
                "::",
                stringify!(flags)
            )
        );
    }
    test_field_flags();
    fn test_field_user_regs() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<vcpu_guest_context>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).user_regs) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(vcpu_guest_context),
                "::",
                stringify!(user_regs)
            )
        );
    }
    test_field_user_regs();
    fn test_field_sctlr() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<vcpu_guest_context>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).sctlr) as usize - ptr as usize
            },
            320usize,
            concat!(
                "Offset of field: ",
                stringify!(vcpu_guest_context),
                "::",
                stringify!(sctlr)
            )
        );
    }
    test_field_sctlr();
    fn test_field_ttbcr() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<vcpu_guest_context>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).ttbcr) as usize - ptr as usize
            },
            328usize,
            concat!(
                "Offset of field: ",
                stringify!(vcpu_guest_context),
                "::",
                stringify!(ttbcr)
            )
        );
    }
    test_field_ttbcr();
    fn test_field_ttbr0() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<vcpu_guest_context>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).ttbr0) as usize - ptr as usize
            },
            336usize,
            concat!(
                "Offset of field: ",
                stringify!(vcpu_guest_context),
                "::",
                stringify!(ttbr0)
            )
        );
    }
    test_field_ttbr0();
    fn test_field_ttbr1() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<vcpu_guest_context>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).ttbr1) as usize - ptr as usize
            },
            344usize,
            concat!(
                "Offset of field: ",
                stringify!(vcpu_guest_context),
                "::",
                stringify!(ttbr1)
            )
        );
    }
    test_field_ttbr1();
}
pub type vcpu_guest_context_t = vcpu_guest_context;
#[repr(C)]
#[derive(Copy, Clone)]
pub union __guest_handle_vcpu_guest_context_t {
    pub p: *mut vcpu_guest_context_t,
    pub q: ::std::os::raw::c_ulong,
}
#[test]
fn bindgen_test_layout___guest_handle_vcpu_guest_context_t() {
    assert_eq!(
        ::std::mem::size_of::<__guest_handle_vcpu_guest_context_t>(),
        8usize,
        concat!("Size of: ", stringify!(__guest_handle_vcpu_guest_context_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__guest_handle_vcpu_guest_context_t>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(__guest_handle_vcpu_guest_context_t)
        )
    );
    fn test_field_p() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<__guest_handle_vcpu_guest_context_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).p) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(__guest_handle_vcpu_guest_context_t),
                "::",
                stringify!(p)
            )
        );
    }
    test_field_p();
    fn test_field_q() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<__guest_handle_vcpu_guest_context_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).q) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(__guest_handle_vcpu_guest_context_t),
                "::",
                stringify!(q)
            )
        );
    }
    test_field_q();
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union __guest_handle_64_vcpu_guest_context_t {
    pub p: *mut vcpu_guest_context_t,
    pub q: u64,
}
#[test]
fn bindgen_test_layout___guest_handle_64_vcpu_guest_context_t() {
    assert_eq!(
        ::std::mem::size_of::<__guest_handle_64_vcpu_guest_context_t>(),
        8usize,
        concat!(
            "Size of: ",
            stringify!(__guest_handle_64_vcpu_guest_context_t)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<__guest_handle_64_vcpu_guest_context_t>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(__guest_handle_64_vcpu_guest_context_t)
        )
    );
    fn test_field_p() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<__guest_handle_64_vcpu_guest_context_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).p) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(__guest_handle_64_vcpu_guest_context_t),
                "::",
                stringify!(p)
            )
        );
    }
    test_field_p();
    fn test_field_q() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<__guest_handle_64_vcpu_guest_context_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).q) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(__guest_handle_64_vcpu_guest_context_t),
                "::",
                stringify!(q)
            )
        );
    }
    test_field_q();
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union __guest_handle_const_vcpu_guest_context_t {
    pub p: *const vcpu_guest_context_t,
    pub q: ::std::os::raw::c_ulong,
}
#[test]
fn bindgen_test_layout___guest_handle_const_vcpu_guest_context_t() {
    assert_eq!(
        ::std::mem::size_of::<__guest_handle_const_vcpu_guest_context_t>(),
        8usize,
        concat!(
            "Size of: ",
            stringify!(__guest_handle_const_vcpu_guest_context_t)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<__guest_handle_const_vcpu_guest_context_t>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(__guest_handle_const_vcpu_guest_context_t)
        )
    );
    fn test_field_p() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<__guest_handle_const_vcpu_guest_context_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).p) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(__guest_handle_const_vcpu_guest_context_t),
                "::",
                stringify!(p)
            )
        );
    }
    test_field_p();
    fn test_field_q() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<__guest_handle_const_vcpu_guest_context_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).q) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(__guest_handle_const_vcpu_guest_context_t),
                "::",
                stringify!(q)
            )
        );
    }
    test_field_q();
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union __guest_handle_64_const_vcpu_guest_context_t {
    pub p: *const vcpu_guest_context_t,
    pub q: u64,
}
#[test]
fn bindgen_test_layout___guest_handle_64_const_vcpu_guest_context_t() {
    assert_eq!(
        ::std::mem::size_of::<__guest_handle_64_const_vcpu_guest_context_t>(),
        8usize,
        concat!(
            "Size of: ",
            stringify!(__guest_handle_64_const_vcpu_guest_context_t)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<__guest_handle_64_const_vcpu_guest_context_t>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(__guest_handle_64_const_vcpu_guest_context_t)
        )
    );
    fn test_field_p() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<__guest_handle_64_const_vcpu_guest_context_t>::uninit(
                    );
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).p) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(__guest_handle_64_const_vcpu_guest_context_t),
                "::",
                stringify!(p)
            )
        );
    }
    test_field_p();
    fn test_field_q() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<__guest_handle_64_const_vcpu_guest_context_t>::uninit(
                    );
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).q) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(__guest_handle_64_const_vcpu_guest_context_t),
                "::",
                stringify!(q)
            )
        );
    }
    test_field_q();
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xen_arch_domainconfig {
    pub gic_version: u8,
    pub tee_type: u16,
    pub nr_spis: u32,
    pub clock_frequency: u32,
}
#[test]
fn bindgen_test_layout_xen_arch_domainconfig() {
    assert_eq!(
        ::std::mem::size_of::<xen_arch_domainconfig>(),
        12usize,
        concat!("Size of: ", stringify!(xen_arch_domainconfig))
    );
    assert_eq!(
        ::std::mem::align_of::<xen_arch_domainconfig>(),
        4usize,
        concat!("Alignment of ", stringify!(xen_arch_domainconfig))
    );
    fn test_field_gic_version() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<xen_arch_domainconfig>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).gic_version) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(xen_arch_domainconfig),
                "::",
                stringify!(gic_version)
            )
        );
    }
    test_field_gic_version();
    fn test_field_tee_type() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<xen_arch_domainconfig>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).tee_type) as usize - ptr as usize
            },
            2usize,
            concat!(
                "Offset of field: ",
                stringify!(xen_arch_domainconfig),
                "::",
                stringify!(tee_type)
            )
        );
    }
    test_field_tee_type();
    fn test_field_nr_spis() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<xen_arch_domainconfig>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).nr_spis) as usize - ptr as usize
            },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(xen_arch_domainconfig),
                "::",
                stringify!(nr_spis)
            )
        );
    }
    test_field_nr_spis();
    fn test_field_clock_frequency() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<xen_arch_domainconfig>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).clock_frequency) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(xen_arch_domainconfig),
                "::",
                stringify!(clock_frequency)
            )
        );
    }
    test_field_clock_frequency();
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct arch_vcpu_info {}
#[test]
fn bindgen_test_layout_arch_vcpu_info() {
    assert_eq!(
        ::std::mem::size_of::<arch_vcpu_info>(),
        0usize,
        concat!("Size of: ", stringify!(arch_vcpu_info))
    );
    assert_eq!(
        ::std::mem::align_of::<arch_vcpu_info>(),
        1usize,
        concat!("Alignment of ", stringify!(arch_vcpu_info))
    );
}
pub type arch_vcpu_info_t = arch_vcpu_info;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct arch_shared_info {}
#[test]
fn bindgen_test_layout_arch_shared_info() {
    assert_eq!(
        ::std::mem::size_of::<arch_shared_info>(),
        0usize,
        concat!("Size of: ", stringify!(arch_shared_info))
    );
    assert_eq!(
        ::std::mem::align_of::<arch_shared_info>(),
        1usize,
        concat!("Alignment of ", stringify!(arch_shared_info))
    );
}
pub type arch_shared_info_t = arch_shared_info;
pub type xen_callback_t = u64;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xen_pmu_arch {
    pub dummy: u8,
}
#[test]
fn bindgen_test_layout_xen_pmu_arch() {
    assert_eq!(
        ::std::mem::size_of::<xen_pmu_arch>(),
        1usize,
        concat!("Size of: ", stringify!(xen_pmu_arch))
    );
    assert_eq!(
        ::std::mem::align_of::<xen_pmu_arch>(),
        1usize,
        concat!("Alignment of ", stringify!(xen_pmu_arch))
    );
    fn test_field_dummy() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<xen_pmu_arch>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).dummy) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(xen_pmu_arch),
                "::",
                stringify!(dummy)
            )
        );
    }
    test_field_dummy();
}
pub type xen_pmu_arch_t = xen_pmu_arch;
#[repr(C)]
#[derive(Copy, Clone)]
pub union __guest_handle_char {
    pub p: *mut ::std::os::raw::c_char,
    pub q: ::std::os::raw::c_ulong,
}
#[test]
fn bindgen_test_layout___guest_handle_char() {
    assert_eq!(
        ::std::mem::size_of::<__guest_handle_char>(),
        8usize,
        concat!("Size of: ", stringify!(__guest_handle_char))
    );
    assert_eq!(
        ::std::mem::align_of::<__guest_handle_char>(),
        8usize,
        concat!("Alignment of ", stringify!(__guest_handle_char))
    );
    fn test_field_p() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<__guest_handle_char>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).p) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(__guest_handle_char),
                "::",
                stringify!(p)
            )
        );
    }
    test_field_p();
    fn test_field_q() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<__guest_handle_char>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).q) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(__guest_handle_char),
                "::",
                stringify!(q)
            )
        );
    }
    test_field_q();
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union __guest_handle_64_char {
    pub p: *mut ::std::os::raw::c_char,
    pub q: u64,
}
#[test]
fn bindgen_test_layout___guest_handle_64_char() {
    assert_eq!(
        ::std::mem::size_of::<__guest_handle_64_char>(),
        8usize,
        concat!("Size of: ", stringify!(__guest_handle_64_char))
    );
    assert_eq!(
        ::std::mem::align_of::<__guest_handle_64_char>(),
        8usize,
        concat!("Alignment of ", stringify!(__guest_handle_64_char))
    );
    fn test_field_p() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<__guest_handle_64_char>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).p) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(__guest_handle_64_char),
                "::",
                stringify!(p)
            )
        );
    }
    test_field_p();
    fn test_field_q() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<__guest_handle_64_char>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).q) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(__guest_handle_64_char),
                "::",
                stringify!(q)
            )
        );
    }
    test_field_q();
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union __guest_handle_const_char {
    pub p: *const ::std::os::raw::c_char,
    pub q: ::std::os::raw::c_ulong,
}
#[test]
fn bindgen_test_layout___guest_handle_const_char() {
    assert_eq!(
        ::std::mem::size_of::<__guest_handle_const_char>(),
        8usize,
        concat!("Size of: ", stringify!(__guest_handle_const_char))
    );
    assert_eq!(
        ::std::mem::align_of::<__guest_handle_const_char>(),
        8usize,
        concat!("Alignment of ", stringify!(__guest_handle_const_char))
    );
    fn test_field_p() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<__guest_handle_const_char>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).p) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(__guest_handle_const_char),
                "::",
                stringify!(p)
            )
        );
    }
    test_field_p();
    fn test_field_q() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<__guest_handle_const_char>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).q) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(__guest_handle_const_char),
                "::",
                stringify!(q)
            )
        );
    }
    test_field_q();
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union __guest_handle_64_const_char {
    pub p: *const ::std::os::raw::c_char,
    pub q: u64,
}
#[test]
fn bindgen_test_layout___guest_handle_64_const_char() {
    assert_eq!(
        ::std::mem::size_of::<__guest_handle_64_const_char>(),
        8usize,
        concat!("Size of: ", stringify!(__guest_handle_64_const_char))
    );
    assert_eq!(
        ::std::mem::align_of::<__guest_handle_64_const_char>(),
        8usize,
        concat!("Alignment of ", stringify!(__guest_handle_64_const_char))
    );
    fn test_field_p() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<__guest_handle_64_const_char>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).p) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(__guest_handle_64_const_char),
                "::",
                stringify!(p)
            )
        );
    }
    test_field_p();
    fn test_field_q() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<__guest_handle_64_const_char>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).q) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(__guest_handle_64_const_char),
                "::",
                stringify!(q)
            )
        );
    }
    test_field_q();
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union __guest_handle_uchar {
    pub p: *mut ::std::os::raw::c_uchar,
    pub q: ::std::os::raw::c_ulong,
}
#[test]
fn bindgen_test_layout___guest_handle_uchar() {
    assert_eq!(
        ::std::mem::size_of::<__guest_handle_uchar>(),
        8usize,
        concat!("Size of: ", stringify!(__guest_handle_uchar))
    );
    assert_eq!(
        ::std::mem::align_of::<__guest_handle_uchar>(),
        8usize,
        concat!("Alignment of ", stringify!(__guest_handle_uchar))
    );
    fn test_field_p() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<__guest_handle_uchar>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).p) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(__guest_handle_uchar),
                "::",
                stringify!(p)
            )
        );
    }
    test_field_p();
    fn test_field_q() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<__guest_handle_uchar>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).q) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(__guest_handle_uchar),
                "::",
                stringify!(q)
            )
        );
    }
    test_field_q();
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union __guest_handle_64_uchar {
    pub p: *mut ::std::os::raw::c_uchar,
    pub q: u64,
}
#[test]
fn bindgen_test_layout___guest_handle_64_uchar() {
    assert_eq!(
        ::std::mem::size_of::<__guest_handle_64_uchar>(),
        8usize,
        concat!("Size of: ", stringify!(__guest_handle_64_uchar))
    );
    assert_eq!(
        ::std::mem::align_of::<__guest_handle_64_uchar>(),
        8usize,
        concat!("Alignment of ", stringify!(__guest_handle_64_uchar))
    );
    fn test_field_p() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<__guest_handle_64_uchar>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).p) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(__guest_handle_64_uchar),
                "::",
                stringify!(p)
            )
        );
    }
    test_field_p();
    fn test_field_q() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<__guest_handle_64_uchar>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).q) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(__guest_handle_64_uchar),
                "::",
                stringify!(q)
            )
        );
    }
    test_field_q();
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union __guest_handle_const_uchar {
    pub p: *const ::std::os::raw::c_uchar,
    pub q: ::std::os::raw::c_ulong,
}
#[test]
fn bindgen_test_layout___guest_handle_const_uchar() {
    assert_eq!(
        ::std::mem::size_of::<__guest_handle_const_uchar>(),
        8usize,
        concat!("Size of: ", stringify!(__guest_handle_const_uchar))
    );
    assert_eq!(
        ::std::mem::align_of::<__guest_handle_const_uchar>(),
        8usize,
        concat!("Alignment of ", stringify!(__guest_handle_const_uchar))
    );
    fn test_field_p() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<__guest_handle_const_uchar>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).p) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(__guest_handle_const_uchar),
                "::",
                stringify!(p)
            )
        );
    }
    test_field_p();
    fn test_field_q() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<__guest_handle_const_uchar>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).q) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(__guest_handle_const_uchar),
                "::",
                stringify!(q)
            )
        );
    }
    test_field_q();
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union __guest_handle_64_const_uchar {
    pub p: *const ::std::os::raw::c_uchar,
    pub q: u64,
}
#[test]
fn bindgen_test_layout___guest_handle_64_const_uchar() {
    assert_eq!(
        ::std::mem::size_of::<__guest_handle_64_const_uchar>(),
        8usize,
        concat!("Size of: ", stringify!(__guest_handle_64_const_uchar))
    );
    assert_eq!(
        ::std::mem::align_of::<__guest_handle_64_const_uchar>(),
        8usize,
        concat!("Alignment of ", stringify!(__guest_handle_64_const_uchar))
    );
    fn test_field_p() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<__guest_handle_64_const_uchar>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).p) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(__guest_handle_64_const_uchar),
                "::",
                stringify!(p)
            )
        );
    }
    test_field_p();
    fn test_field_q() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<__guest_handle_64_const_uchar>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).q) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(__guest_handle_64_const_uchar),
                "::",
                stringify!(q)
            )
        );
    }
    test_field_q();
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union __guest_handle_int {
    pub p: *mut ::std::os::raw::c_int,
    pub q: ::std::os::raw::c_ulong,
}
#[test]
fn bindgen_test_layout___guest_handle_int() {
    assert_eq!(
        ::std::mem::size_of::<__guest_handle_int>(),
        8usize,
        concat!("Size of: ", stringify!(__guest_handle_int))
    );
    assert_eq!(
        ::std::mem::align_of::<__guest_handle_int>(),
        8usize,
        concat!("Alignment of ", stringify!(__guest_handle_int))
    );
    fn test_field_p() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<__guest_handle_int>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).p) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(__guest_handle_int),
                "::",
                stringify!(p)
            )
        );
    }
    test_field_p();
    fn test_field_q() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<__guest_handle_int>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).q) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(__guest_handle_int),
                "::",
                stringify!(q)
            )
        );
    }
    test_field_q();
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union __guest_handle_64_int {
    pub p: *mut ::std::os::raw::c_int,
    pub q: u64,
}
#[test]
fn bindgen_test_layout___guest_handle_64_int() {
    assert_eq!(
        ::std::mem::size_of::<__guest_handle_64_int>(),
        8usize,
        concat!("Size of: ", stringify!(__guest_handle_64_int))
    );
    assert_eq!(
        ::std::mem::align_of::<__guest_handle_64_int>(),
        8usize,
        concat!("Alignment of ", stringify!(__guest_handle_64_int))
    );
    fn test_field_p() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<__guest_handle_64_int>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).p) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(__guest_handle_64_int),
                "::",
                stringify!(p)
            )
        );
    }
    test_field_p();
    fn test_field_q() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<__guest_handle_64_int>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).q) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(__guest_handle_64_int),
                "::",
                stringify!(q)
            )
        );
    }
    test_field_q();
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union __guest_handle_const_int {
    pub p: *const ::std::os::raw::c_int,
    pub q: ::std::os::raw::c_ulong,
}
#[test]
fn bindgen_test_layout___guest_handle_const_int() {
    assert_eq!(
        ::std::mem::size_of::<__guest_handle_const_int>(),
        8usize,
        concat!("Size of: ", stringify!(__guest_handle_const_int))
    );
    assert_eq!(
        ::std::mem::align_of::<__guest_handle_const_int>(),
        8usize,
        concat!("Alignment of ", stringify!(__guest_handle_const_int))
    );
    fn test_field_p() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<__guest_handle_const_int>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).p) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(__guest_handle_const_int),
                "::",
                stringify!(p)
            )
        );
    }
    test_field_p();
    fn test_field_q() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<__guest_handle_const_int>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).q) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(__guest_handle_const_int),
                "::",
                stringify!(q)
            )
        );
    }
    test_field_q();
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union __guest_handle_64_const_int {
    pub p: *const ::std::os::raw::c_int,
    pub q: u64,
}
#[test]
fn bindgen_test_layout___guest_handle_64_const_int() {
    assert_eq!(
        ::std::mem::size_of::<__guest_handle_64_const_int>(),
        8usize,
        concat!("Size of: ", stringify!(__guest_handle_64_const_int))
    );
    assert_eq!(
        ::std::mem::align_of::<__guest_handle_64_const_int>(),
        8usize,
        concat!("Alignment of ", stringify!(__guest_handle_64_const_int))
    );
    fn test_field_p() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<__guest_handle_64_const_int>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).p) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(__guest_handle_64_const_int),
                "::",
                stringify!(p)
            )
        );
    }
    test_field_p();
    fn test_field_q() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<__guest_handle_64_const_int>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).q) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(__guest_handle_64_const_int),
                "::",
                stringify!(q)
            )
        );
    }
    test_field_q();
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union __guest_handle_uint {
    pub p: *mut ::std::os::raw::c_uint,
    pub q: ::std::os::raw::c_ulong,
}
#[test]
fn bindgen_test_layout___guest_handle_uint() {
    assert_eq!(
        ::std::mem::size_of::<__guest_handle_uint>(),
        8usize,
        concat!("Size of: ", stringify!(__guest_handle_uint))
    );
    assert_eq!(
        ::std::mem::align_of::<__guest_handle_uint>(),
        8usize,
        concat!("Alignment of ", stringify!(__guest_handle_uint))
    );
    fn test_field_p() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<__guest_handle_uint>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).p) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(__guest_handle_uint),
                "::",
                stringify!(p)
            )
        );
    }
    test_field_p();
    fn test_field_q() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<__guest_handle_uint>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).q) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(__guest_handle_uint),
                "::",
                stringify!(q)
            )
        );
    }
    test_field_q();
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union __guest_handle_64_uint {
    pub p: *mut ::std::os::raw::c_uint,
    pub q: u64,
}
#[test]
fn bindgen_test_layout___guest_handle_64_uint() {
    assert_eq!(
        ::std::mem::size_of::<__guest_handle_64_uint>(),
        8usize,
        concat!("Size of: ", stringify!(__guest_handle_64_uint))
    );
    assert_eq!(
        ::std::mem::align_of::<__guest_handle_64_uint>(),
        8usize,
        concat!("Alignment of ", stringify!(__guest_handle_64_uint))
    );
    fn test_field_p() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<__guest_handle_64_uint>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).p) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(__guest_handle_64_uint),
                "::",
                stringify!(p)
            )
        );
    }
    test_field_p();
    fn test_field_q() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<__guest_handle_64_uint>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).q) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(__guest_handle_64_uint),
                "::",
                stringify!(q)
            )
        );
    }
    test_field_q();
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union __guest_handle_const_uint {
    pub p: *const ::std::os::raw::c_uint,
    pub q: ::std::os::raw::c_ulong,
}
#[test]
fn bindgen_test_layout___guest_handle_const_uint() {
    assert_eq!(
        ::std::mem::size_of::<__guest_handle_const_uint>(),
        8usize,
        concat!("Size of: ", stringify!(__guest_handle_const_uint))
    );
    assert_eq!(
        ::std::mem::align_of::<__guest_handle_const_uint>(),
        8usize,
        concat!("Alignment of ", stringify!(__guest_handle_const_uint))
    );
    fn test_field_p() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<__guest_handle_const_uint>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).p) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(__guest_handle_const_uint),
                "::",
                stringify!(p)
            )
        );
    }
    test_field_p();
    fn test_field_q() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<__guest_handle_const_uint>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).q) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(__guest_handle_const_uint),
                "::",
                stringify!(q)
            )
        );
    }
    test_field_q();
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union __guest_handle_64_const_uint {
    pub p: *const ::std::os::raw::c_uint,
    pub q: u64,
}
#[test]
fn bindgen_test_layout___guest_handle_64_const_uint() {
    assert_eq!(
        ::std::mem::size_of::<__guest_handle_64_const_uint>(),
        8usize,
        concat!("Size of: ", stringify!(__guest_handle_64_const_uint))
    );
    assert_eq!(
        ::std::mem::align_of::<__guest_handle_64_const_uint>(),
        8usize,
        concat!("Alignment of ", stringify!(__guest_handle_64_const_uint))
    );
    fn test_field_p() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<__guest_handle_64_const_uint>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).p) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(__guest_handle_64_const_uint),
                "::",
                stringify!(p)
            )
        );
    }
    test_field_p();
    fn test_field_q() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<__guest_handle_64_const_uint>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).q) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(__guest_handle_64_const_uint),
                "::",
                stringify!(q)
            )
        );
    }
    test_field_q();
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union __guest_handle_void {
    pub p: *mut ::std::os::raw::c_void,
    pub q: ::std::os::raw::c_ulong,
}
#[test]
fn bindgen_test_layout___guest_handle_void() {
    assert_eq!(
        ::std::mem::size_of::<__guest_handle_void>(),
        8usize,
        concat!("Size of: ", stringify!(__guest_handle_void))
    );
    assert_eq!(
        ::std::mem::align_of::<__guest_handle_void>(),
        8usize,
        concat!("Alignment of ", stringify!(__guest_handle_void))
    );
    fn test_field_p() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<__guest_handle_void>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).p) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(__guest_handle_void),
                "::",
                stringify!(p)
            )
        );
    }
    test_field_p();
    fn test_field_q() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<__guest_handle_void>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).q) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(__guest_handle_void),
                "::",
                stringify!(q)
            )
        );
    }
    test_field_q();
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union __guest_handle_64_void {
    pub p: *mut ::std::os::raw::c_void,
    pub q: u64,
}
#[test]
fn bindgen_test_layout___guest_handle_64_void() {
    assert_eq!(
        ::std::mem::size_of::<__guest_handle_64_void>(),
        8usize,
        concat!("Size of: ", stringify!(__guest_handle_64_void))
    );
    assert_eq!(
        ::std::mem::align_of::<__guest_handle_64_void>(),
        8usize,
        concat!("Alignment of ", stringify!(__guest_handle_64_void))
    );
    fn test_field_p() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<__guest_handle_64_void>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).p) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(__guest_handle_64_void),
                "::",
                stringify!(p)
            )
        );
    }
    test_field_p();
    fn test_field_q() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<__guest_handle_64_void>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).q) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(__guest_handle_64_void),
                "::",
                stringify!(q)
            )
        );
    }
    test_field_q();
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union __guest_handle_const_void {
    pub p: *const ::std::os::raw::c_void,
    pub q: ::std::os::raw::c_ulong,
}
#[test]
fn bindgen_test_layout___guest_handle_const_void() {
    assert_eq!(
        ::std::mem::size_of::<__guest_handle_const_void>(),
        8usize,
        concat!("Size of: ", stringify!(__guest_handle_const_void))
    );
    assert_eq!(
        ::std::mem::align_of::<__guest_handle_const_void>(),
        8usize,
        concat!("Alignment of ", stringify!(__guest_handle_const_void))
    );
    fn test_field_p() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<__guest_handle_const_void>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).p) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(__guest_handle_const_void),
                "::",
                stringify!(p)
            )
        );
    }
    test_field_p();
    fn test_field_q() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<__guest_handle_const_void>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).q) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(__guest_handle_const_void),
                "::",
                stringify!(q)
            )
        );
    }
    test_field_q();
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union __guest_handle_64_const_void {
    pub p: *const ::std::os::raw::c_void,
    pub q: u64,
}
#[test]
fn bindgen_test_layout___guest_handle_64_const_void() {
    assert_eq!(
        ::std::mem::size_of::<__guest_handle_64_const_void>(),
        8usize,
        concat!("Size of: ", stringify!(__guest_handle_64_const_void))
    );
    assert_eq!(
        ::std::mem::align_of::<__guest_handle_64_const_void>(),
        8usize,
        concat!("Alignment of ", stringify!(__guest_handle_64_const_void))
    );
    fn test_field_p() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<__guest_handle_64_const_void>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).p) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(__guest_handle_64_const_void),
                "::",
                stringify!(p)
            )
        );
    }
    test_field_p();
    fn test_field_q() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<__guest_handle_64_const_void>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).q) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(__guest_handle_64_const_void),
                "::",
                stringify!(q)
            )
        );
    }
    test_field_q();
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union __guest_handle_uint64_t {
    pub p: *mut u64,
    pub q: ::std::os::raw::c_ulong,
}
#[test]
fn bindgen_test_layout___guest_handle_uint64_t() {
    assert_eq!(
        ::std::mem::size_of::<__guest_handle_uint64_t>(),
        8usize,
        concat!("Size of: ", stringify!(__guest_handle_uint64_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__guest_handle_uint64_t>(),
        8usize,
        concat!("Alignment of ", stringify!(__guest_handle_uint64_t))
    );
    fn test_field_p() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<__guest_handle_uint64_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).p) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(__guest_handle_uint64_t),
                "::",
                stringify!(p)
            )
        );
    }
    test_field_p();
    fn test_field_q() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<__guest_handle_uint64_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).q) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(__guest_handle_uint64_t),
                "::",
                stringify!(q)
            )
        );
    }
    test_field_q();
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union __guest_handle_64_uint64_t {
    pub p: *mut u64,
    pub q: u64,
}
#[test]
fn bindgen_test_layout___guest_handle_64_uint64_t() {
    assert_eq!(
        ::std::mem::size_of::<__guest_handle_64_uint64_t>(),
        8usize,
        concat!("Size of: ", stringify!(__guest_handle_64_uint64_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__guest_handle_64_uint64_t>(),
        8usize,
        concat!("Alignment of ", stringify!(__guest_handle_64_uint64_t))
    );
    fn test_field_p() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<__guest_handle_64_uint64_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).p) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(__guest_handle_64_uint64_t),
                "::",
                stringify!(p)
            )
        );
    }
    test_field_p();
    fn test_field_q() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<__guest_handle_64_uint64_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).q) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(__guest_handle_64_uint64_t),
                "::",
                stringify!(q)
            )
        );
    }
    test_field_q();
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union __guest_handle_const_uint64_t {
    pub p: *const u64,
    pub q: ::std::os::raw::c_ulong,
}
#[test]
fn bindgen_test_layout___guest_handle_const_uint64_t() {
    assert_eq!(
        ::std::mem::size_of::<__guest_handle_const_uint64_t>(),
        8usize,
        concat!("Size of: ", stringify!(__guest_handle_const_uint64_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__guest_handle_const_uint64_t>(),
        8usize,
        concat!("Alignment of ", stringify!(__guest_handle_const_uint64_t))
    );
    fn test_field_p() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<__guest_handle_const_uint64_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).p) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(__guest_handle_const_uint64_t),
                "::",
                stringify!(p)
            )
        );
    }
    test_field_p();
    fn test_field_q() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<__guest_handle_const_uint64_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).q) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(__guest_handle_const_uint64_t),
                "::",
                stringify!(q)
            )
        );
    }
    test_field_q();
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union __guest_handle_64_const_uint64_t {
    pub p: *const u64,
    pub q: u64,
}
#[test]
fn bindgen_test_layout___guest_handle_64_const_uint64_t() {
    assert_eq!(
        ::std::mem::size_of::<__guest_handle_64_const_uint64_t>(),
        8usize,
        concat!("Size of: ", stringify!(__guest_handle_64_const_uint64_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__guest_handle_64_const_uint64_t>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(__guest_handle_64_const_uint64_t)
        )
    );
    fn test_field_p() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<__guest_handle_64_const_uint64_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).p) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(__guest_handle_64_const_uint64_t),
                "::",
                stringify!(p)
            )
        );
    }
    test_field_p();
    fn test_field_q() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<__guest_handle_64_const_uint64_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).q) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(__guest_handle_64_const_uint64_t),
                "::",
                stringify!(q)
            )
        );
    }
    test_field_q();
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union __guest_handle_xen_pfn_t {
    pub p: *mut xen_pfn_t,
    pub q: ::std::os::raw::c_ulong,
}
#[test]
fn bindgen_test_layout___guest_handle_xen_pfn_t() {
    assert_eq!(
        ::std::mem::size_of::<__guest_handle_xen_pfn_t>(),
        8usize,
        concat!("Size of: ", stringify!(__guest_handle_xen_pfn_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__guest_handle_xen_pfn_t>(),
        8usize,
        concat!("Alignment of ", stringify!(__guest_handle_xen_pfn_t))
    );
    fn test_field_p() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<__guest_handle_xen_pfn_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).p) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(__guest_handle_xen_pfn_t),
                "::",
                stringify!(p)
            )
        );
    }
    test_field_p();
    fn test_field_q() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<__guest_handle_xen_pfn_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).q) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(__guest_handle_xen_pfn_t),
                "::",
                stringify!(q)
            )
        );
    }
    test_field_q();
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union __guest_handle_64_xen_pfn_t {
    pub p: *mut xen_pfn_t,
    pub q: u64,
}
#[test]
fn bindgen_test_layout___guest_handle_64_xen_pfn_t() {
    assert_eq!(
        ::std::mem::size_of::<__guest_handle_64_xen_pfn_t>(),
        8usize,
        concat!("Size of: ", stringify!(__guest_handle_64_xen_pfn_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__guest_handle_64_xen_pfn_t>(),
        8usize,
        concat!("Alignment of ", stringify!(__guest_handle_64_xen_pfn_t))
    );
    fn test_field_p() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<__guest_handle_64_xen_pfn_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).p) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(__guest_handle_64_xen_pfn_t),
                "::",
                stringify!(p)
            )
        );
    }
    test_field_p();
    fn test_field_q() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<__guest_handle_64_xen_pfn_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).q) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(__guest_handle_64_xen_pfn_t),
                "::",
                stringify!(q)
            )
        );
    }
    test_field_q();
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union __guest_handle_const_xen_pfn_t {
    pub p: *const xen_pfn_t,
    pub q: ::std::os::raw::c_ulong,
}
#[test]
fn bindgen_test_layout___guest_handle_const_xen_pfn_t() {
    assert_eq!(
        ::std::mem::size_of::<__guest_handle_const_xen_pfn_t>(),
        8usize,
        concat!("Size of: ", stringify!(__guest_handle_const_xen_pfn_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__guest_handle_const_xen_pfn_t>(),
        8usize,
        concat!("Alignment of ", stringify!(__guest_handle_const_xen_pfn_t))
    );
    fn test_field_p() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<__guest_handle_const_xen_pfn_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).p) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(__guest_handle_const_xen_pfn_t),
                "::",
                stringify!(p)
            )
        );
    }
    test_field_p();
    fn test_field_q() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<__guest_handle_const_xen_pfn_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).q) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(__guest_handle_const_xen_pfn_t),
                "::",
                stringify!(q)
            )
        );
    }
    test_field_q();
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union __guest_handle_64_const_xen_pfn_t {
    pub p: *const xen_pfn_t,
    pub q: u64,
}
#[test]
fn bindgen_test_layout___guest_handle_64_const_xen_pfn_t() {
    assert_eq!(
        ::std::mem::size_of::<__guest_handle_64_const_xen_pfn_t>(),
        8usize,
        concat!("Size of: ", stringify!(__guest_handle_64_const_xen_pfn_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__guest_handle_64_const_xen_pfn_t>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(__guest_handle_64_const_xen_pfn_t)
        )
    );
    fn test_field_p() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<__guest_handle_64_const_xen_pfn_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).p) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(__guest_handle_64_const_xen_pfn_t),
                "::",
                stringify!(p)
            )
        );
    }
    test_field_p();
    fn test_field_q() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<__guest_handle_64_const_xen_pfn_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).q) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(__guest_handle_64_const_xen_pfn_t),
                "::",
                stringify!(q)
            )
        );
    }
    test_field_q();
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union __guest_handle_xen_ulong_t {
    pub p: *mut xen_ulong_t,
    pub q: ::std::os::raw::c_ulong,
}
#[test]
fn bindgen_test_layout___guest_handle_xen_ulong_t() {
    assert_eq!(
        ::std::mem::size_of::<__guest_handle_xen_ulong_t>(),
        8usize,
        concat!("Size of: ", stringify!(__guest_handle_xen_ulong_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__guest_handle_xen_ulong_t>(),
        8usize,
        concat!("Alignment of ", stringify!(__guest_handle_xen_ulong_t))
    );
    fn test_field_p() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<__guest_handle_xen_ulong_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).p) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(__guest_handle_xen_ulong_t),
                "::",
                stringify!(p)
            )
        );
    }
    test_field_p();
    fn test_field_q() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<__guest_handle_xen_ulong_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).q) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(__guest_handle_xen_ulong_t),
                "::",
                stringify!(q)
            )
        );
    }
    test_field_q();
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union __guest_handle_64_xen_ulong_t {
    pub p: *mut xen_ulong_t,
    pub q: u64,
}
#[test]
fn bindgen_test_layout___guest_handle_64_xen_ulong_t() {
    assert_eq!(
        ::std::mem::size_of::<__guest_handle_64_xen_ulong_t>(),
        8usize,
        concat!("Size of: ", stringify!(__guest_handle_64_xen_ulong_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__guest_handle_64_xen_ulong_t>(),
        8usize,
        concat!("Alignment of ", stringify!(__guest_handle_64_xen_ulong_t))
    );
    fn test_field_p() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<__guest_handle_64_xen_ulong_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).p) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(__guest_handle_64_xen_ulong_t),
                "::",
                stringify!(p)
            )
        );
    }
    test_field_p();
    fn test_field_q() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<__guest_handle_64_xen_ulong_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).q) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(__guest_handle_64_xen_ulong_t),
                "::",
                stringify!(q)
            )
        );
    }
    test_field_q();
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union __guest_handle_const_xen_ulong_t {
    pub p: *const xen_ulong_t,
    pub q: ::std::os::raw::c_ulong,
}
#[test]
fn bindgen_test_layout___guest_handle_const_xen_ulong_t() {
    assert_eq!(
        ::std::mem::size_of::<__guest_handle_const_xen_ulong_t>(),
        8usize,
        concat!("Size of: ", stringify!(__guest_handle_const_xen_ulong_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__guest_handle_const_xen_ulong_t>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(__guest_handle_const_xen_ulong_t)
        )
    );
    fn test_field_p() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<__guest_handle_const_xen_ulong_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).p) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(__guest_handle_const_xen_ulong_t),
                "::",
                stringify!(p)
            )
        );
    }
    test_field_p();
    fn test_field_q() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<__guest_handle_const_xen_ulong_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).q) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(__guest_handle_const_xen_ulong_t),
                "::",
                stringify!(q)
            )
        );
    }
    test_field_q();
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union __guest_handle_64_const_xen_ulong_t {
    pub p: *const xen_ulong_t,
    pub q: u64,
}
#[test]
fn bindgen_test_layout___guest_handle_64_const_xen_ulong_t() {
    assert_eq!(
        ::std::mem::size_of::<__guest_handle_64_const_xen_ulong_t>(),
        8usize,
        concat!("Size of: ", stringify!(__guest_handle_64_const_xen_ulong_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__guest_handle_64_const_xen_ulong_t>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(__guest_handle_64_const_xen_ulong_t)
        )
    );
    fn test_field_p() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<__guest_handle_64_const_xen_ulong_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).p) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(__guest_handle_64_const_xen_ulong_t),
                "::",
                stringify!(p)
            )
        );
    }
    test_field_p();
    fn test_field_q() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<__guest_handle_64_const_xen_ulong_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).q) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(__guest_handle_64_const_xen_ulong_t),
                "::",
                stringify!(q)
            )
        );
    }
    test_field_q();
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct mmuext_op {
    pub cmd: ::std::os::raw::c_uint,
    pub arg1: mmuext_op__bindgen_ty_1,
    pub arg2: mmuext_op__bindgen_ty_2,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union mmuext_op__bindgen_ty_1 {
    pub mfn: xen_pfn_t,
    pub linear_addr: ::std::os::raw::c_ulong,
}
#[test]
fn bindgen_test_layout_mmuext_op__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<mmuext_op__bindgen_ty_1>(),
        8usize,
        concat!("Size of: ", stringify!(mmuext_op__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<mmuext_op__bindgen_ty_1>(),
        8usize,
        concat!("Alignment of ", stringify!(mmuext_op__bindgen_ty_1))
    );
    fn test_field_mfn() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<mmuext_op__bindgen_ty_1>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).mfn) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(mmuext_op__bindgen_ty_1),
                "::",
                stringify!(mfn)
            )
        );
    }
    test_field_mfn();
    fn test_field_linear_addr() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<mmuext_op__bindgen_ty_1>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).linear_addr) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(mmuext_op__bindgen_ty_1),
                "::",
                stringify!(linear_addr)
            )
        );
    }
    test_field_linear_addr();
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union mmuext_op__bindgen_ty_2 {
    pub nr_ents: ::std::os::raw::c_uint,
    pub vcpumask: __guest_handle_64_const_void,
    pub src_mfn: xen_pfn_t,
}
#[test]
fn bindgen_test_layout_mmuext_op__bindgen_ty_2() {
    assert_eq!(
        ::std::mem::size_of::<mmuext_op__bindgen_ty_2>(),
        8usize,
        concat!("Size of: ", stringify!(mmuext_op__bindgen_ty_2))
    );
    assert_eq!(
        ::std::mem::align_of::<mmuext_op__bindgen_ty_2>(),
        8usize,
        concat!("Alignment of ", stringify!(mmuext_op__bindgen_ty_2))
    );
    fn test_field_nr_ents() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<mmuext_op__bindgen_ty_2>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).nr_ents) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(mmuext_op__bindgen_ty_2),
                "::",
                stringify!(nr_ents)
            )
        );
    }
    test_field_nr_ents();
    fn test_field_vcpumask() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<mmuext_op__bindgen_ty_2>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).vcpumask) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(mmuext_op__bindgen_ty_2),
                "::",
                stringify!(vcpumask)
            )
        );
    }
    test_field_vcpumask();
    fn test_field_src_mfn() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<mmuext_op__bindgen_ty_2>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).src_mfn) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(mmuext_op__bindgen_ty_2),
                "::",
                stringify!(src_mfn)
            )
        );
    }
    test_field_src_mfn();
}
#[test]
fn bindgen_test_layout_mmuext_op() {
    assert_eq!(
        ::std::mem::size_of::<mmuext_op>(),
        24usize,
        concat!("Size of: ", stringify!(mmuext_op))
    );
    assert_eq!(
        ::std::mem::align_of::<mmuext_op>(),
        8usize,
        concat!("Alignment of ", stringify!(mmuext_op))
    );
    fn test_field_cmd() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<mmuext_op>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).cmd) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(mmuext_op),
                "::",
                stringify!(cmd)
            )
        );
    }
    test_field_cmd();
    fn test_field_arg1() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<mmuext_op>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).arg1) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(mmuext_op),
                "::",
                stringify!(arg1)
            )
        );
    }
    test_field_arg1();
    fn test_field_arg2() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<mmuext_op>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).arg2) as usize - ptr as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(mmuext_op),
                "::",
                stringify!(arg2)
            )
        );
    }
    test_field_arg2();
}
pub type mmuext_op_t = mmuext_op;
#[repr(C)]
#[derive(Copy, Clone)]
pub union __guest_handle_mmuext_op_t {
    pub p: *mut mmuext_op_t,
    pub q: ::std::os::raw::c_ulong,
}
#[test]
fn bindgen_test_layout___guest_handle_mmuext_op_t() {
    assert_eq!(
        ::std::mem::size_of::<__guest_handle_mmuext_op_t>(),
        8usize,
        concat!("Size of: ", stringify!(__guest_handle_mmuext_op_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__guest_handle_mmuext_op_t>(),
        8usize,
        concat!("Alignment of ", stringify!(__guest_handle_mmuext_op_t))
    );
    fn test_field_p() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<__guest_handle_mmuext_op_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).p) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(__guest_handle_mmuext_op_t),
                "::",
                stringify!(p)
            )
        );
    }
    test_field_p();
    fn test_field_q() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<__guest_handle_mmuext_op_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).q) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(__guest_handle_mmuext_op_t),
                "::",
                stringify!(q)
            )
        );
    }
    test_field_q();
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union __guest_handle_64_mmuext_op_t {
    pub p: *mut mmuext_op_t,
    pub q: u64,
}
#[test]
fn bindgen_test_layout___guest_handle_64_mmuext_op_t() {
    assert_eq!(
        ::std::mem::size_of::<__guest_handle_64_mmuext_op_t>(),
        8usize,
        concat!("Size of: ", stringify!(__guest_handle_64_mmuext_op_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__guest_handle_64_mmuext_op_t>(),
        8usize,
        concat!("Alignment of ", stringify!(__guest_handle_64_mmuext_op_t))
    );
    fn test_field_p() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<__guest_handle_64_mmuext_op_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).p) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(__guest_handle_64_mmuext_op_t),
                "::",
                stringify!(p)
            )
        );
    }
    test_field_p();
    fn test_field_q() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<__guest_handle_64_mmuext_op_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).q) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(__guest_handle_64_mmuext_op_t),
                "::",
                stringify!(q)
            )
        );
    }
    test_field_q();
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union __guest_handle_const_mmuext_op_t {
    pub p: *const mmuext_op_t,
    pub q: ::std::os::raw::c_ulong,
}
#[test]
fn bindgen_test_layout___guest_handle_const_mmuext_op_t() {
    assert_eq!(
        ::std::mem::size_of::<__guest_handle_const_mmuext_op_t>(),
        8usize,
        concat!("Size of: ", stringify!(__guest_handle_const_mmuext_op_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__guest_handle_const_mmuext_op_t>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(__guest_handle_const_mmuext_op_t)
        )
    );
    fn test_field_p() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<__guest_handle_const_mmuext_op_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).p) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(__guest_handle_const_mmuext_op_t),
                "::",
                stringify!(p)
            )
        );
    }
    test_field_p();
    fn test_field_q() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<__guest_handle_const_mmuext_op_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).q) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(__guest_handle_const_mmuext_op_t),
                "::",
                stringify!(q)
            )
        );
    }
    test_field_q();
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union __guest_handle_64_const_mmuext_op_t {
    pub p: *const mmuext_op_t,
    pub q: u64,
}
#[test]
fn bindgen_test_layout___guest_handle_64_const_mmuext_op_t() {
    assert_eq!(
        ::std::mem::size_of::<__guest_handle_64_const_mmuext_op_t>(),
        8usize,
        concat!("Size of: ", stringify!(__guest_handle_64_const_mmuext_op_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__guest_handle_64_const_mmuext_op_t>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(__guest_handle_64_const_mmuext_op_t)
        )
    );
    fn test_field_p() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<__guest_handle_64_const_mmuext_op_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).p) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(__guest_handle_64_const_mmuext_op_t),
                "::",
                stringify!(p)
            )
        );
    }
    test_field_p();
    fn test_field_q() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<__guest_handle_64_const_mmuext_op_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).q) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(__guest_handle_64_const_mmuext_op_t),
                "::",
                stringify!(q)
            )
        );
    }
    test_field_q();
}
pub type domid_t = u16;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct mmu_update {
    pub ptr: u64,
    pub val: u64,
}
#[test]
fn bindgen_test_layout_mmu_update() {
    assert_eq!(
        ::std::mem::size_of::<mmu_update>(),
        16usize,
        concat!("Size of: ", stringify!(mmu_update))
    );
    assert_eq!(
        ::std::mem::align_of::<mmu_update>(),
        8usize,
        concat!("Alignment of ", stringify!(mmu_update))
    );
    fn test_field_ptr() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<mmu_update>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).ptr) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(mmu_update),
                "::",
                stringify!(ptr)
            )
        );
    }
    test_field_ptr();
    fn test_field_val() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<mmu_update>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).val) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(mmu_update),
                "::",
                stringify!(val)
            )
        );
    }
    test_field_val();
}
pub type mmu_update_t = mmu_update;
#[repr(C)]
#[derive(Copy, Clone)]
pub union __guest_handle_mmu_update_t {
    pub p: *mut mmu_update_t,
    pub q: ::std::os::raw::c_ulong,
}
#[test]
fn bindgen_test_layout___guest_handle_mmu_update_t() {
    assert_eq!(
        ::std::mem::size_of::<__guest_handle_mmu_update_t>(),
        8usize,
        concat!("Size of: ", stringify!(__guest_handle_mmu_update_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__guest_handle_mmu_update_t>(),
        8usize,
        concat!("Alignment of ", stringify!(__guest_handle_mmu_update_t))
    );
    fn test_field_p() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<__guest_handle_mmu_update_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).p) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(__guest_handle_mmu_update_t),
                "::",
                stringify!(p)
            )
        );
    }
    test_field_p();
    fn test_field_q() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<__guest_handle_mmu_update_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).q) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(__guest_handle_mmu_update_t),
                "::",
                stringify!(q)
            )
        );
    }
    test_field_q();
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union __guest_handle_64_mmu_update_t {
    pub p: *mut mmu_update_t,
    pub q: u64,
}
#[test]
fn bindgen_test_layout___guest_handle_64_mmu_update_t() {
    assert_eq!(
        ::std::mem::size_of::<__guest_handle_64_mmu_update_t>(),
        8usize,
        concat!("Size of: ", stringify!(__guest_handle_64_mmu_update_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__guest_handle_64_mmu_update_t>(),
        8usize,
        concat!("Alignment of ", stringify!(__guest_handle_64_mmu_update_t))
    );
    fn test_field_p() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<__guest_handle_64_mmu_update_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).p) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(__guest_handle_64_mmu_update_t),
                "::",
                stringify!(p)
            )
        );
    }
    test_field_p();
    fn test_field_q() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<__guest_handle_64_mmu_update_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).q) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(__guest_handle_64_mmu_update_t),
                "::",
                stringify!(q)
            )
        );
    }
    test_field_q();
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union __guest_handle_const_mmu_update_t {
    pub p: *const mmu_update_t,
    pub q: ::std::os::raw::c_ulong,
}
#[test]
fn bindgen_test_layout___guest_handle_const_mmu_update_t() {
    assert_eq!(
        ::std::mem::size_of::<__guest_handle_const_mmu_update_t>(),
        8usize,
        concat!("Size of: ", stringify!(__guest_handle_const_mmu_update_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__guest_handle_const_mmu_update_t>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(__guest_handle_const_mmu_update_t)
        )
    );
    fn test_field_p() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<__guest_handle_const_mmu_update_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).p) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(__guest_handle_const_mmu_update_t),
                "::",
                stringify!(p)
            )
        );
    }
    test_field_p();
    fn test_field_q() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<__guest_handle_const_mmu_update_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).q) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(__guest_handle_const_mmu_update_t),
                "::",
                stringify!(q)
            )
        );
    }
    test_field_q();
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union __guest_handle_64_const_mmu_update_t {
    pub p: *const mmu_update_t,
    pub q: u64,
}
#[test]
fn bindgen_test_layout___guest_handle_64_const_mmu_update_t() {
    assert_eq!(
        ::std::mem::size_of::<__guest_handle_64_const_mmu_update_t>(),
        8usize,
        concat!(
            "Size of: ",
            stringify!(__guest_handle_64_const_mmu_update_t)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<__guest_handle_64_const_mmu_update_t>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(__guest_handle_64_const_mmu_update_t)
        )
    );
    fn test_field_p() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<__guest_handle_64_const_mmu_update_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).p) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(__guest_handle_64_const_mmu_update_t),
                "::",
                stringify!(p)
            )
        );
    }
    test_field_p();
    fn test_field_q() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<__guest_handle_64_const_mmu_update_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).q) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(__guest_handle_64_const_mmu_update_t),
                "::",
                stringify!(q)
            )
        );
    }
    test_field_q();
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct multicall_entry {
    pub op: xen_ulong_t,
    pub result: xen_ulong_t,
    pub args: [xen_ulong_t; 6usize],
}
#[test]
fn bindgen_test_layout_multicall_entry() {
    assert_eq!(
        ::std::mem::size_of::<multicall_entry>(),
        64usize,
        concat!("Size of: ", stringify!(multicall_entry))
    );
    assert_eq!(
        ::std::mem::align_of::<multicall_entry>(),
        8usize,
        concat!("Alignment of ", stringify!(multicall_entry))
    );
    fn test_field_op() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<multicall_entry>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).op) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(multicall_entry),
                "::",
                stringify!(op)
            )
        );
    }
    test_field_op();
    fn test_field_result() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<multicall_entry>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).result) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(multicall_entry),
                "::",
                stringify!(result)
            )
        );
    }
    test_field_result();
    fn test_field_args() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<multicall_entry>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).args) as usize - ptr as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(multicall_entry),
                "::",
                stringify!(args)
            )
        );
    }
    test_field_args();
}
pub type multicall_entry_t = multicall_entry;
#[repr(C)]
#[derive(Copy, Clone)]
pub union __guest_handle_multicall_entry_t {
    pub p: *mut multicall_entry_t,
    pub q: ::std::os::raw::c_ulong,
}
#[test]
fn bindgen_test_layout___guest_handle_multicall_entry_t() {
    assert_eq!(
        ::std::mem::size_of::<__guest_handle_multicall_entry_t>(),
        8usize,
        concat!("Size of: ", stringify!(__guest_handle_multicall_entry_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__guest_handle_multicall_entry_t>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(__guest_handle_multicall_entry_t)
        )
    );
    fn test_field_p() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<__guest_handle_multicall_entry_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).p) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(__guest_handle_multicall_entry_t),
                "::",
                stringify!(p)
            )
        );
    }
    test_field_p();
    fn test_field_q() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<__guest_handle_multicall_entry_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).q) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(__guest_handle_multicall_entry_t),
                "::",
                stringify!(q)
            )
        );
    }
    test_field_q();
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union __guest_handle_64_multicall_entry_t {
    pub p: *mut multicall_entry_t,
    pub q: u64,
}
#[test]
fn bindgen_test_layout___guest_handle_64_multicall_entry_t() {
    assert_eq!(
        ::std::mem::size_of::<__guest_handle_64_multicall_entry_t>(),
        8usize,
        concat!("Size of: ", stringify!(__guest_handle_64_multicall_entry_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__guest_handle_64_multicall_entry_t>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(__guest_handle_64_multicall_entry_t)
        )
    );
    fn test_field_p() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<__guest_handle_64_multicall_entry_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).p) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(__guest_handle_64_multicall_entry_t),
                "::",
                stringify!(p)
            )
        );
    }
    test_field_p();
    fn test_field_q() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<__guest_handle_64_multicall_entry_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).q) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(__guest_handle_64_multicall_entry_t),
                "::",
                stringify!(q)
            )
        );
    }
    test_field_q();
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union __guest_handle_const_multicall_entry_t {
    pub p: *const multicall_entry_t,
    pub q: ::std::os::raw::c_ulong,
}
#[test]
fn bindgen_test_layout___guest_handle_const_multicall_entry_t() {
    assert_eq!(
        ::std::mem::size_of::<__guest_handle_const_multicall_entry_t>(),
        8usize,
        concat!(
            "Size of: ",
            stringify!(__guest_handle_const_multicall_entry_t)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<__guest_handle_const_multicall_entry_t>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(__guest_handle_const_multicall_entry_t)
        )
    );
    fn test_field_p() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<__guest_handle_const_multicall_entry_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).p) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(__guest_handle_const_multicall_entry_t),
                "::",
                stringify!(p)
            )
        );
    }
    test_field_p();
    fn test_field_q() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<__guest_handle_const_multicall_entry_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).q) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(__guest_handle_const_multicall_entry_t),
                "::",
                stringify!(q)
            )
        );
    }
    test_field_q();
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union __guest_handle_64_const_multicall_entry_t {
    pub p: *const multicall_entry_t,
    pub q: u64,
}
#[test]
fn bindgen_test_layout___guest_handle_64_const_multicall_entry_t() {
    assert_eq!(
        ::std::mem::size_of::<__guest_handle_64_const_multicall_entry_t>(),
        8usize,
        concat!(
            "Size of: ",
            stringify!(__guest_handle_64_const_multicall_entry_t)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<__guest_handle_64_const_multicall_entry_t>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(__guest_handle_64_const_multicall_entry_t)
        )
    );
    fn test_field_p() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<__guest_handle_64_const_multicall_entry_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).p) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(__guest_handle_64_const_multicall_entry_t),
                "::",
                stringify!(p)
            )
        );
    }
    test_field_p();
    fn test_field_q() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<__guest_handle_64_const_multicall_entry_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).q) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(__guest_handle_64_const_multicall_entry_t),
                "::",
                stringify!(q)
            )
        );
    }
    test_field_q();
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct vcpu_time_info {
    pub version: u32,
    pub pad0: u32,
    pub tsc_timestamp: u64,
    pub system_time: u64,
    pub tsc_to_system_mul: u32,
    pub tsc_shift: i8,
    pub flags: u8,
    pub pad1: [u8; 2usize],
}
#[test]
fn bindgen_test_layout_vcpu_time_info() {
    assert_eq!(
        ::std::mem::size_of::<vcpu_time_info>(),
        32usize,
        concat!("Size of: ", stringify!(vcpu_time_info))
    );
    assert_eq!(
        ::std::mem::align_of::<vcpu_time_info>(),
        8usize,
        concat!("Alignment of ", stringify!(vcpu_time_info))
    );
    fn test_field_version() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<vcpu_time_info>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).version) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(vcpu_time_info),
                "::",
                stringify!(version)
            )
        );
    }
    test_field_version();
    fn test_field_pad0() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<vcpu_time_info>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).pad0) as usize - ptr as usize
            },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(vcpu_time_info),
                "::",
                stringify!(pad0)
            )
        );
    }
    test_field_pad0();
    fn test_field_tsc_timestamp() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<vcpu_time_info>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).tsc_timestamp) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(vcpu_time_info),
                "::",
                stringify!(tsc_timestamp)
            )
        );
    }
    test_field_tsc_timestamp();
    fn test_field_system_time() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<vcpu_time_info>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).system_time) as usize - ptr as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(vcpu_time_info),
                "::",
                stringify!(system_time)
            )
        );
    }
    test_field_system_time();
    fn test_field_tsc_to_system_mul() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<vcpu_time_info>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).tsc_to_system_mul) as usize - ptr as usize
            },
            24usize,
            concat!(
                "Offset of field: ",
                stringify!(vcpu_time_info),
                "::",
                stringify!(tsc_to_system_mul)
            )
        );
    }
    test_field_tsc_to_system_mul();
    fn test_field_tsc_shift() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<vcpu_time_info>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).tsc_shift) as usize - ptr as usize
            },
            28usize,
            concat!(
                "Offset of field: ",
                stringify!(vcpu_time_info),
                "::",
                stringify!(tsc_shift)
            )
        );
    }
    test_field_tsc_shift();
    fn test_field_flags() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<vcpu_time_info>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).flags) as usize - ptr as usize
            },
            29usize,
            concat!(
                "Offset of field: ",
                stringify!(vcpu_time_info),
                "::",
                stringify!(flags)
            )
        );
    }
    test_field_flags();
    fn test_field_pad1() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<vcpu_time_info>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).pad1) as usize - ptr as usize
            },
            30usize,
            concat!(
                "Offset of field: ",
                stringify!(vcpu_time_info),
                "::",
                stringify!(pad1)
            )
        );
    }
    test_field_pad1();
}
pub type vcpu_time_info_t = vcpu_time_info;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct vcpu_info {
    pub evtchn_upcall_pending: u8,
    pub pad0: u8,
    pub evtchn_pending_sel: xen_ulong_t,
    pub arch: arch_vcpu_info,
    pub time: vcpu_time_info_t,
}
#[test]
fn bindgen_test_layout_vcpu_info() {
    assert_eq!(
        ::std::mem::size_of::<vcpu_info>(),
        48usize,
        concat!("Size of: ", stringify!(vcpu_info))
    );
    assert_eq!(
        ::std::mem::align_of::<vcpu_info>(),
        8usize,
        concat!("Alignment of ", stringify!(vcpu_info))
    );
    fn test_field_evtchn_upcall_pending() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<vcpu_info>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).evtchn_upcall_pending) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(vcpu_info),
                "::",
                stringify!(evtchn_upcall_pending)
            )
        );
    }
    test_field_evtchn_upcall_pending();
    fn test_field_pad0() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<vcpu_info>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).pad0) as usize - ptr as usize
            },
            1usize,
            concat!(
                "Offset of field: ",
                stringify!(vcpu_info),
                "::",
                stringify!(pad0)
            )
        );
    }
    test_field_pad0();
    fn test_field_evtchn_pending_sel() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<vcpu_info>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).evtchn_pending_sel) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(vcpu_info),
                "::",
                stringify!(evtchn_pending_sel)
            )
        );
    }
    test_field_evtchn_pending_sel();
    fn test_field_arch() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<vcpu_info>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).arch) as usize - ptr as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(vcpu_info),
                "::",
                stringify!(arch)
            )
        );
    }
    test_field_arch();
    fn test_field_time() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<vcpu_info>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).time) as usize - ptr as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(vcpu_info),
                "::",
                stringify!(time)
            )
        );
    }
    test_field_time();
}
pub type vcpu_info_t = vcpu_info;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct shared_info {
    pub vcpu_info: [vcpu_info; 1usize],
    pub evtchn_pending: [xen_ulong_t; 64usize],
    pub evtchn_mask: [xen_ulong_t; 64usize],
    pub wc_version: u32,
    pub wc_sec: u32,
    pub wc_nsec: u32,
    pub wc_sec_hi: u32,
    pub arch: arch_shared_info,
}
#[test]
fn bindgen_test_layout_shared_info() {
    assert_eq!(
        ::std::mem::size_of::<shared_info>(),
        1088usize,
        concat!("Size of: ", stringify!(shared_info))
    );
    assert_eq!(
        ::std::mem::align_of::<shared_info>(),
        8usize,
        concat!("Alignment of ", stringify!(shared_info))
    );
    fn test_field_vcpu_info() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<shared_info>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).vcpu_info) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(shared_info),
                "::",
                stringify!(vcpu_info)
            )
        );
    }
    test_field_vcpu_info();
    fn test_field_evtchn_pending() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<shared_info>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).evtchn_pending) as usize - ptr as usize
            },
            48usize,
            concat!(
                "Offset of field: ",
                stringify!(shared_info),
                "::",
                stringify!(evtchn_pending)
            )
        );
    }
    test_field_evtchn_pending();
    fn test_field_evtchn_mask() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<shared_info>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).evtchn_mask) as usize - ptr as usize
            },
            560usize,
            concat!(
                "Offset of field: ",
                stringify!(shared_info),
                "::",
                stringify!(evtchn_mask)
            )
        );
    }
    test_field_evtchn_mask();
    fn test_field_wc_version() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<shared_info>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).wc_version) as usize - ptr as usize
            },
            1072usize,
            concat!(
                "Offset of field: ",
                stringify!(shared_info),
                "::",
                stringify!(wc_version)
            )
        );
    }
    test_field_wc_version();
    fn test_field_wc_sec() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<shared_info>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).wc_sec) as usize - ptr as usize
            },
            1076usize,
            concat!(
                "Offset of field: ",
                stringify!(shared_info),
                "::",
                stringify!(wc_sec)
            )
        );
    }
    test_field_wc_sec();
    fn test_field_wc_nsec() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<shared_info>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).wc_nsec) as usize - ptr as usize
            },
            1080usize,
            concat!(
                "Offset of field: ",
                stringify!(shared_info),
                "::",
                stringify!(wc_nsec)
            )
        );
    }
    test_field_wc_nsec();
    fn test_field_wc_sec_hi() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<shared_info>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).wc_sec_hi) as usize - ptr as usize
            },
            1084usize,
            concat!(
                "Offset of field: ",
                stringify!(shared_info),
                "::",
                stringify!(wc_sec_hi)
            )
        );
    }
    test_field_wc_sec_hi();
    fn test_field_arch() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<shared_info>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).arch) as usize - ptr as usize
            },
            1088usize,
            concat!(
                "Offset of field: ",
                stringify!(shared_info),
                "::",
                stringify!(arch)
            )
        );
    }
    test_field_arch();
}
pub type shared_info_t = shared_info;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xen_multiboot_mod_list {
    pub mod_start: u32,
    pub mod_end: u32,
    pub cmdline: u32,
    pub pad: u32,
}
#[test]
fn bindgen_test_layout_xen_multiboot_mod_list() {
    assert_eq!(
        ::std::mem::size_of::<xen_multiboot_mod_list>(),
        16usize,
        concat!("Size of: ", stringify!(xen_multiboot_mod_list))
    );
    assert_eq!(
        ::std::mem::align_of::<xen_multiboot_mod_list>(),
        4usize,
        concat!("Alignment of ", stringify!(xen_multiboot_mod_list))
    );
    fn test_field_mod_start() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<xen_multiboot_mod_list>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).mod_start) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(xen_multiboot_mod_list),
                "::",
                stringify!(mod_start)
            )
        );
    }
    test_field_mod_start();
    fn test_field_mod_end() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<xen_multiboot_mod_list>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).mod_end) as usize - ptr as usize
            },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(xen_multiboot_mod_list),
                "::",
                stringify!(mod_end)
            )
        );
    }
    test_field_mod_end();
    fn test_field_cmdline() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<xen_multiboot_mod_list>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).cmdline) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(xen_multiboot_mod_list),
                "::",
                stringify!(cmdline)
            )
        );
    }
    test_field_cmdline();
    fn test_field_pad() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<xen_multiboot_mod_list>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).pad) as usize - ptr as usize
            },
            12usize,
            concat!(
                "Offset of field: ",
                stringify!(xen_multiboot_mod_list),
                "::",
                stringify!(pad)
            )
        );
    }
    test_field_pad();
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct dom0_vga_console_info {
    pub video_type: u8,
    pub u: dom0_vga_console_info__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union dom0_vga_console_info__bindgen_ty_1 {
    pub text_mode_3: dom0_vga_console_info__bindgen_ty_1__bindgen_ty_1,
    pub vesa_lfb: dom0_vga_console_info__bindgen_ty_1__bindgen_ty_2,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct dom0_vga_console_info__bindgen_ty_1__bindgen_ty_1 {
    pub font_height: u16,
    pub cursor_x: u16,
    pub cursor_y: u16,
    pub rows: u16,
    pub columns: u16,
}
#[test]
fn bindgen_test_layout_dom0_vga_console_info__bindgen_ty_1__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<dom0_vga_console_info__bindgen_ty_1__bindgen_ty_1>(),
        10usize,
        concat!(
            "Size of: ",
            stringify!(dom0_vga_console_info__bindgen_ty_1__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<dom0_vga_console_info__bindgen_ty_1__bindgen_ty_1>(),
        2usize,
        concat!(
            "Alignment of ",
            stringify!(dom0_vga_console_info__bindgen_ty_1__bindgen_ty_1)
        )
    );
    fn test_field_font_height() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<
                    dom0_vga_console_info__bindgen_ty_1__bindgen_ty_1,
                >::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).font_height) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(dom0_vga_console_info__bindgen_ty_1__bindgen_ty_1),
                "::",
                stringify!(font_height)
            )
        );
    }
    test_field_font_height();
    fn test_field_cursor_x() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<
                    dom0_vga_console_info__bindgen_ty_1__bindgen_ty_1,
                >::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).cursor_x) as usize - ptr as usize
            },
            2usize,
            concat!(
                "Offset of field: ",
                stringify!(dom0_vga_console_info__bindgen_ty_1__bindgen_ty_1),
                "::",
                stringify!(cursor_x)
            )
        );
    }
    test_field_cursor_x();
    fn test_field_cursor_y() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<
                    dom0_vga_console_info__bindgen_ty_1__bindgen_ty_1,
                >::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).cursor_y) as usize - ptr as usize
            },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(dom0_vga_console_info__bindgen_ty_1__bindgen_ty_1),
                "::",
                stringify!(cursor_y)
            )
        );
    }
    test_field_cursor_y();
    fn test_field_rows() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<
                    dom0_vga_console_info__bindgen_ty_1__bindgen_ty_1,
                >::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).rows) as usize - ptr as usize
            },
            6usize,
            concat!(
                "Offset of field: ",
                stringify!(dom0_vga_console_info__bindgen_ty_1__bindgen_ty_1),
                "::",
                stringify!(rows)
            )
        );
    }
    test_field_rows();
    fn test_field_columns() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<
                    dom0_vga_console_info__bindgen_ty_1__bindgen_ty_1,
                >::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).columns) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(dom0_vga_console_info__bindgen_ty_1__bindgen_ty_1),
                "::",
                stringify!(columns)
            )
        );
    }
    test_field_columns();
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct dom0_vga_console_info__bindgen_ty_1__bindgen_ty_2 {
    pub width: u16,
    pub height: u16,
    pub bytes_per_line: u16,
    pub bits_per_pixel: u16,
    pub lfb_base: u32,
    pub lfb_size: u32,
    pub red_pos: u8,
    pub red_size: u8,
    pub green_pos: u8,
    pub green_size: u8,
    pub blue_pos: u8,
    pub blue_size: u8,
    pub rsvd_pos: u8,
    pub rsvd_size: u8,
    pub gbl_caps: u32,
    pub mode_attrs: u16,
    pub pad: u16,
    pub ext_lfb_base: u32,
}
#[test]
fn bindgen_test_layout_dom0_vga_console_info__bindgen_ty_1__bindgen_ty_2() {
    assert_eq!(
        ::std::mem::size_of::<dom0_vga_console_info__bindgen_ty_1__bindgen_ty_2>(),
        36usize,
        concat!(
            "Size of: ",
            stringify!(dom0_vga_console_info__bindgen_ty_1__bindgen_ty_2)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<dom0_vga_console_info__bindgen_ty_1__bindgen_ty_2>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(dom0_vga_console_info__bindgen_ty_1__bindgen_ty_2)
        )
    );
    fn test_field_width() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<
                    dom0_vga_console_info__bindgen_ty_1__bindgen_ty_2,
                >::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).width) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(dom0_vga_console_info__bindgen_ty_1__bindgen_ty_2),
                "::",
                stringify!(width)
            )
        );
    }
    test_field_width();
    fn test_field_height() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<
                    dom0_vga_console_info__bindgen_ty_1__bindgen_ty_2,
                >::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).height) as usize - ptr as usize
            },
            2usize,
            concat!(
                "Offset of field: ",
                stringify!(dom0_vga_console_info__bindgen_ty_1__bindgen_ty_2),
                "::",
                stringify!(height)
            )
        );
    }
    test_field_height();
    fn test_field_bytes_per_line() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<
                    dom0_vga_console_info__bindgen_ty_1__bindgen_ty_2,
                >::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).bytes_per_line) as usize - ptr as usize
            },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(dom0_vga_console_info__bindgen_ty_1__bindgen_ty_2),
                "::",
                stringify!(bytes_per_line)
            )
        );
    }
    test_field_bytes_per_line();
    fn test_field_bits_per_pixel() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<
                    dom0_vga_console_info__bindgen_ty_1__bindgen_ty_2,
                >::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).bits_per_pixel) as usize - ptr as usize
            },
            6usize,
            concat!(
                "Offset of field: ",
                stringify!(dom0_vga_console_info__bindgen_ty_1__bindgen_ty_2),
                "::",
                stringify!(bits_per_pixel)
            )
        );
    }
    test_field_bits_per_pixel();
    fn test_field_lfb_base() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<
                    dom0_vga_console_info__bindgen_ty_1__bindgen_ty_2,
                >::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).lfb_base) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(dom0_vga_console_info__bindgen_ty_1__bindgen_ty_2),
                "::",
                stringify!(lfb_base)
            )
        );
    }
    test_field_lfb_base();
    fn test_field_lfb_size() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<
                    dom0_vga_console_info__bindgen_ty_1__bindgen_ty_2,
                >::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).lfb_size) as usize - ptr as usize
            },
            12usize,
            concat!(
                "Offset of field: ",
                stringify!(dom0_vga_console_info__bindgen_ty_1__bindgen_ty_2),
                "::",
                stringify!(lfb_size)
            )
        );
    }
    test_field_lfb_size();
    fn test_field_red_pos() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<
                    dom0_vga_console_info__bindgen_ty_1__bindgen_ty_2,
                >::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).red_pos) as usize - ptr as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(dom0_vga_console_info__bindgen_ty_1__bindgen_ty_2),
                "::",
                stringify!(red_pos)
            )
        );
    }
    test_field_red_pos();
    fn test_field_red_size() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<
                    dom0_vga_console_info__bindgen_ty_1__bindgen_ty_2,
                >::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).red_size) as usize - ptr as usize
            },
            17usize,
            concat!(
                "Offset of field: ",
                stringify!(dom0_vga_console_info__bindgen_ty_1__bindgen_ty_2),
                "::",
                stringify!(red_size)
            )
        );
    }
    test_field_red_size();
    fn test_field_green_pos() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<
                    dom0_vga_console_info__bindgen_ty_1__bindgen_ty_2,
                >::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).green_pos) as usize - ptr as usize
            },
            18usize,
            concat!(
                "Offset of field: ",
                stringify!(dom0_vga_console_info__bindgen_ty_1__bindgen_ty_2),
                "::",
                stringify!(green_pos)
            )
        );
    }
    test_field_green_pos();
    fn test_field_green_size() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<
                    dom0_vga_console_info__bindgen_ty_1__bindgen_ty_2,
                >::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).green_size) as usize - ptr as usize
            },
            19usize,
            concat!(
                "Offset of field: ",
                stringify!(dom0_vga_console_info__bindgen_ty_1__bindgen_ty_2),
                "::",
                stringify!(green_size)
            )
        );
    }
    test_field_green_size();
    fn test_field_blue_pos() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<
                    dom0_vga_console_info__bindgen_ty_1__bindgen_ty_2,
                >::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).blue_pos) as usize - ptr as usize
            },
            20usize,
            concat!(
                "Offset of field: ",
                stringify!(dom0_vga_console_info__bindgen_ty_1__bindgen_ty_2),
                "::",
                stringify!(blue_pos)
            )
        );
    }
    test_field_blue_pos();
    fn test_field_blue_size() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<
                    dom0_vga_console_info__bindgen_ty_1__bindgen_ty_2,
                >::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).blue_size) as usize - ptr as usize
            },
            21usize,
            concat!(
                "Offset of field: ",
                stringify!(dom0_vga_console_info__bindgen_ty_1__bindgen_ty_2),
                "::",
                stringify!(blue_size)
            )
        );
    }
    test_field_blue_size();
    fn test_field_rsvd_pos() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<
                    dom0_vga_console_info__bindgen_ty_1__bindgen_ty_2,
                >::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).rsvd_pos) as usize - ptr as usize
            },
            22usize,
            concat!(
                "Offset of field: ",
                stringify!(dom0_vga_console_info__bindgen_ty_1__bindgen_ty_2),
                "::",
                stringify!(rsvd_pos)
            )
        );
    }
    test_field_rsvd_pos();
    fn test_field_rsvd_size() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<
                    dom0_vga_console_info__bindgen_ty_1__bindgen_ty_2,
                >::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).rsvd_size) as usize - ptr as usize
            },
            23usize,
            concat!(
                "Offset of field: ",
                stringify!(dom0_vga_console_info__bindgen_ty_1__bindgen_ty_2),
                "::",
                stringify!(rsvd_size)
            )
        );
    }
    test_field_rsvd_size();
    fn test_field_gbl_caps() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<
                    dom0_vga_console_info__bindgen_ty_1__bindgen_ty_2,
                >::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).gbl_caps) as usize - ptr as usize
            },
            24usize,
            concat!(
                "Offset of field: ",
                stringify!(dom0_vga_console_info__bindgen_ty_1__bindgen_ty_2),
                "::",
                stringify!(gbl_caps)
            )
        );
    }
    test_field_gbl_caps();
    fn test_field_mode_attrs() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<
                    dom0_vga_console_info__bindgen_ty_1__bindgen_ty_2,
                >::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).mode_attrs) as usize - ptr as usize
            },
            28usize,
            concat!(
                "Offset of field: ",
                stringify!(dom0_vga_console_info__bindgen_ty_1__bindgen_ty_2),
                "::",
                stringify!(mode_attrs)
            )
        );
    }
    test_field_mode_attrs();
    fn test_field_pad() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<
                    dom0_vga_console_info__bindgen_ty_1__bindgen_ty_2,
                >::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).pad) as usize - ptr as usize
            },
            30usize,
            concat!(
                "Offset of field: ",
                stringify!(dom0_vga_console_info__bindgen_ty_1__bindgen_ty_2),
                "::",
                stringify!(pad)
            )
        );
    }
    test_field_pad();
    fn test_field_ext_lfb_base() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<
                    dom0_vga_console_info__bindgen_ty_1__bindgen_ty_2,
                >::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).ext_lfb_base) as usize - ptr as usize
            },
            32usize,
            concat!(
                "Offset of field: ",
                stringify!(dom0_vga_console_info__bindgen_ty_1__bindgen_ty_2),
                "::",
                stringify!(ext_lfb_base)
            )
        );
    }
    test_field_ext_lfb_base();
}
#[test]
fn bindgen_test_layout_dom0_vga_console_info__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<dom0_vga_console_info__bindgen_ty_1>(),
        36usize,
        concat!("Size of: ", stringify!(dom0_vga_console_info__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<dom0_vga_console_info__bindgen_ty_1>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(dom0_vga_console_info__bindgen_ty_1)
        )
    );
    fn test_field_text_mode_3() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<dom0_vga_console_info__bindgen_ty_1>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).text_mode_3) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(dom0_vga_console_info__bindgen_ty_1),
                "::",
                stringify!(text_mode_3)
            )
        );
    }
    test_field_text_mode_3();
    fn test_field_vesa_lfb() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<dom0_vga_console_info__bindgen_ty_1>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).vesa_lfb) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(dom0_vga_console_info__bindgen_ty_1),
                "::",
                stringify!(vesa_lfb)
            )
        );
    }
    test_field_vesa_lfb();
}
#[test]
fn bindgen_test_layout_dom0_vga_console_info() {
    assert_eq!(
        ::std::mem::size_of::<dom0_vga_console_info>(),
        40usize,
        concat!("Size of: ", stringify!(dom0_vga_console_info))
    );
    assert_eq!(
        ::std::mem::align_of::<dom0_vga_console_info>(),
        4usize,
        concat!("Alignment of ", stringify!(dom0_vga_console_info))
    );
    fn test_field_video_type() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<dom0_vga_console_info>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).video_type) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(dom0_vga_console_info),
                "::",
                stringify!(video_type)
            )
        );
    }
    test_field_video_type();
    fn test_field_u() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<dom0_vga_console_info>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).u) as usize - ptr as usize
            },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(dom0_vga_console_info),
                "::",
                stringify!(u)
            )
        );
    }
    test_field_u();
}
pub type dom0_vga_console_info_t = dom0_vga_console_info;
pub type xen_domain_handle_t = [u8; 16usize];
#[repr(C)]
#[derive(Copy, Clone)]
pub union __guest_handle_uint8 {
    pub p: *mut u8,
    pub q: ::std::os::raw::c_ulong,
}
#[test]
fn bindgen_test_layout___guest_handle_uint8() {
    assert_eq!(
        ::std::mem::size_of::<__guest_handle_uint8>(),
        8usize,
        concat!("Size of: ", stringify!(__guest_handle_uint8))
    );
    assert_eq!(
        ::std::mem::align_of::<__guest_handle_uint8>(),
        8usize,
        concat!("Alignment of ", stringify!(__guest_handle_uint8))
    );
    fn test_field_p() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<__guest_handle_uint8>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).p) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(__guest_handle_uint8),
                "::",
                stringify!(p)
            )
        );
    }
    test_field_p();
    fn test_field_q() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<__guest_handle_uint8>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).q) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(__guest_handle_uint8),
                "::",
                stringify!(q)
            )
        );
    }
    test_field_q();
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union __guest_handle_64_uint8 {
    pub p: *mut u8,
    pub q: u64,
}
#[test]
fn bindgen_test_layout___guest_handle_64_uint8() {
    assert_eq!(
        ::std::mem::size_of::<__guest_handle_64_uint8>(),
        8usize,
        concat!("Size of: ", stringify!(__guest_handle_64_uint8))
    );
    assert_eq!(
        ::std::mem::align_of::<__guest_handle_64_uint8>(),
        8usize,
        concat!("Alignment of ", stringify!(__guest_handle_64_uint8))
    );
    fn test_field_p() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<__guest_handle_64_uint8>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).p) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(__guest_handle_64_uint8),
                "::",
                stringify!(p)
            )
        );
    }
    test_field_p();
    fn test_field_q() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<__guest_handle_64_uint8>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).q) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(__guest_handle_64_uint8),
                "::",
                stringify!(q)
            )
        );
    }
    test_field_q();
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union __guest_handle_const_uint8 {
    pub p: *const u8,
    pub q: ::std::os::raw::c_ulong,
}
#[test]
fn bindgen_test_layout___guest_handle_const_uint8() {
    assert_eq!(
        ::std::mem::size_of::<__guest_handle_const_uint8>(),
        8usize,
        concat!("Size of: ", stringify!(__guest_handle_const_uint8))
    );
    assert_eq!(
        ::std::mem::align_of::<__guest_handle_const_uint8>(),
        8usize,
        concat!("Alignment of ", stringify!(__guest_handle_const_uint8))
    );
    fn test_field_p() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<__guest_handle_const_uint8>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).p) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(__guest_handle_const_uint8),
                "::",
                stringify!(p)
            )
        );
    }
    test_field_p();
    fn test_field_q() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<__guest_handle_const_uint8>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).q) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(__guest_handle_const_uint8),
                "::",
                stringify!(q)
            )
        );
    }
    test_field_q();
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union __guest_handle_64_const_uint8 {
    pub p: *const u8,
    pub q: u64,
}
#[test]
fn bindgen_test_layout___guest_handle_64_const_uint8() {
    assert_eq!(
        ::std::mem::size_of::<__guest_handle_64_const_uint8>(),
        8usize,
        concat!("Size of: ", stringify!(__guest_handle_64_const_uint8))
    );
    assert_eq!(
        ::std::mem::align_of::<__guest_handle_64_const_uint8>(),
        8usize,
        concat!("Alignment of ", stringify!(__guest_handle_64_const_uint8))
    );
    fn test_field_p() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<__guest_handle_64_const_uint8>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).p) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(__guest_handle_64_const_uint8),
                "::",
                stringify!(p)
            )
        );
    }
    test_field_p();
    fn test_field_q() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<__guest_handle_64_const_uint8>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).q) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(__guest_handle_64_const_uint8),
                "::",
                stringify!(q)
            )
        );
    }
    test_field_q();
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union __guest_handle_uint16 {
    pub p: *mut u16,
    pub q: ::std::os::raw::c_ulong,
}
#[test]
fn bindgen_test_layout___guest_handle_uint16() {
    assert_eq!(
        ::std::mem::size_of::<__guest_handle_uint16>(),
        8usize,
        concat!("Size of: ", stringify!(__guest_handle_uint16))
    );
    assert_eq!(
        ::std::mem::align_of::<__guest_handle_uint16>(),
        8usize,
        concat!("Alignment of ", stringify!(__guest_handle_uint16))
    );
    fn test_field_p() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<__guest_handle_uint16>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).p) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(__guest_handle_uint16),
                "::",
                stringify!(p)
            )
        );
    }
    test_field_p();
    fn test_field_q() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<__guest_handle_uint16>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).q) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(__guest_handle_uint16),
                "::",
                stringify!(q)
            )
        );
    }
    test_field_q();
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union __guest_handle_64_uint16 {
    pub p: *mut u16,
    pub q: u64,
}
#[test]
fn bindgen_test_layout___guest_handle_64_uint16() {
    assert_eq!(
        ::std::mem::size_of::<__guest_handle_64_uint16>(),
        8usize,
        concat!("Size of: ", stringify!(__guest_handle_64_uint16))
    );
    assert_eq!(
        ::std::mem::align_of::<__guest_handle_64_uint16>(),
        8usize,
        concat!("Alignment of ", stringify!(__guest_handle_64_uint16))
    );
    fn test_field_p() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<__guest_handle_64_uint16>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).p) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(__guest_handle_64_uint16),
                "::",
                stringify!(p)
            )
        );
    }
    test_field_p();
    fn test_field_q() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<__guest_handle_64_uint16>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).q) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(__guest_handle_64_uint16),
                "::",
                stringify!(q)
            )
        );
    }
    test_field_q();
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union __guest_handle_const_uint16 {
    pub p: *const u16,
    pub q: ::std::os::raw::c_ulong,
}
#[test]
fn bindgen_test_layout___guest_handle_const_uint16() {
    assert_eq!(
        ::std::mem::size_of::<__guest_handle_const_uint16>(),
        8usize,
        concat!("Size of: ", stringify!(__guest_handle_const_uint16))
    );
    assert_eq!(
        ::std::mem::align_of::<__guest_handle_const_uint16>(),
        8usize,
        concat!("Alignment of ", stringify!(__guest_handle_const_uint16))
    );
    fn test_field_p() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<__guest_handle_const_uint16>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).p) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(__guest_handle_const_uint16),
                "::",
                stringify!(p)
            )
        );
    }
    test_field_p();
    fn test_field_q() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<__guest_handle_const_uint16>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).q) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(__guest_handle_const_uint16),
                "::",
                stringify!(q)
            )
        );
    }
    test_field_q();
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union __guest_handle_64_const_uint16 {
    pub p: *const u16,
    pub q: u64,
}
#[test]
fn bindgen_test_layout___guest_handle_64_const_uint16() {
    assert_eq!(
        ::std::mem::size_of::<__guest_handle_64_const_uint16>(),
        8usize,
        concat!("Size of: ", stringify!(__guest_handle_64_const_uint16))
    );
    assert_eq!(
        ::std::mem::align_of::<__guest_handle_64_const_uint16>(),
        8usize,
        concat!("Alignment of ", stringify!(__guest_handle_64_const_uint16))
    );
    fn test_field_p() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<__guest_handle_64_const_uint16>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).p) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(__guest_handle_64_const_uint16),
                "::",
                stringify!(p)
            )
        );
    }
    test_field_p();
    fn test_field_q() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<__guest_handle_64_const_uint16>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).q) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(__guest_handle_64_const_uint16),
                "::",
                stringify!(q)
            )
        );
    }
    test_field_q();
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union __guest_handle_uint32 {
    pub p: *mut u32,
    pub q: ::std::os::raw::c_ulong,
}
#[test]
fn bindgen_test_layout___guest_handle_uint32() {
    assert_eq!(
        ::std::mem::size_of::<__guest_handle_uint32>(),
        8usize,
        concat!("Size of: ", stringify!(__guest_handle_uint32))
    );
    assert_eq!(
        ::std::mem::align_of::<__guest_handle_uint32>(),
        8usize,
        concat!("Alignment of ", stringify!(__guest_handle_uint32))
    );
    fn test_field_p() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<__guest_handle_uint32>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).p) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(__guest_handle_uint32),
                "::",
                stringify!(p)
            )
        );
    }
    test_field_p();
    fn test_field_q() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<__guest_handle_uint32>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).q) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(__guest_handle_uint32),
                "::",
                stringify!(q)
            )
        );
    }
    test_field_q();
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union __guest_handle_64_uint32 {
    pub p: *mut u32,
    pub q: u64,
}
#[test]
fn bindgen_test_layout___guest_handle_64_uint32() {
    assert_eq!(
        ::std::mem::size_of::<__guest_handle_64_uint32>(),
        8usize,
        concat!("Size of: ", stringify!(__guest_handle_64_uint32))
    );
    assert_eq!(
        ::std::mem::align_of::<__guest_handle_64_uint32>(),
        8usize,
        concat!("Alignment of ", stringify!(__guest_handle_64_uint32))
    );
    fn test_field_p() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<__guest_handle_64_uint32>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).p) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(__guest_handle_64_uint32),
                "::",
                stringify!(p)
            )
        );
    }
    test_field_p();
    fn test_field_q() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<__guest_handle_64_uint32>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).q) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(__guest_handle_64_uint32),
                "::",
                stringify!(q)
            )
        );
    }
    test_field_q();
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union __guest_handle_const_uint32 {
    pub p: *const u32,
    pub q: ::std::os::raw::c_ulong,
}
#[test]
fn bindgen_test_layout___guest_handle_const_uint32() {
    assert_eq!(
        ::std::mem::size_of::<__guest_handle_const_uint32>(),
        8usize,
        concat!("Size of: ", stringify!(__guest_handle_const_uint32))
    );
    assert_eq!(
        ::std::mem::align_of::<__guest_handle_const_uint32>(),
        8usize,
        concat!("Alignment of ", stringify!(__guest_handle_const_uint32))
    );
    fn test_field_p() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<__guest_handle_const_uint32>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).p) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(__guest_handle_const_uint32),
                "::",
                stringify!(p)
            )
        );
    }
    test_field_p();
    fn test_field_q() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<__guest_handle_const_uint32>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).q) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(__guest_handle_const_uint32),
                "::",
                stringify!(q)
            )
        );
    }
    test_field_q();
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union __guest_handle_64_const_uint32 {
    pub p: *const u32,
    pub q: u64,
}
#[test]
fn bindgen_test_layout___guest_handle_64_const_uint32() {
    assert_eq!(
        ::std::mem::size_of::<__guest_handle_64_const_uint32>(),
        8usize,
        concat!("Size of: ", stringify!(__guest_handle_64_const_uint32))
    );
    assert_eq!(
        ::std::mem::align_of::<__guest_handle_64_const_uint32>(),
        8usize,
        concat!("Alignment of ", stringify!(__guest_handle_64_const_uint32))
    );
    fn test_field_p() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<__guest_handle_64_const_uint32>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).p) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(__guest_handle_64_const_uint32),
                "::",
                stringify!(p)
            )
        );
    }
    test_field_p();
    fn test_field_q() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<__guest_handle_64_const_uint32>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).q) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(__guest_handle_64_const_uint32),
                "::",
                stringify!(q)
            )
        );
    }
    test_field_q();
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union __guest_handle_uint64 {
    pub p: *mut u64,
    pub q: ::std::os::raw::c_ulong,
}
#[test]
fn bindgen_test_layout___guest_handle_uint64() {
    assert_eq!(
        ::std::mem::size_of::<__guest_handle_uint64>(),
        8usize,
        concat!("Size of: ", stringify!(__guest_handle_uint64))
    );
    assert_eq!(
        ::std::mem::align_of::<__guest_handle_uint64>(),
        8usize,
        concat!("Alignment of ", stringify!(__guest_handle_uint64))
    );
    fn test_field_p() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<__guest_handle_uint64>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).p) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(__guest_handle_uint64),
                "::",
                stringify!(p)
            )
        );
    }
    test_field_p();
    fn test_field_q() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<__guest_handle_uint64>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).q) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(__guest_handle_uint64),
                "::",
                stringify!(q)
            )
        );
    }
    test_field_q();
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union __guest_handle_64_uint64 {
    pub p: *mut u64,
    pub q: u64,
}
#[test]
fn bindgen_test_layout___guest_handle_64_uint64() {
    assert_eq!(
        ::std::mem::size_of::<__guest_handle_64_uint64>(),
        8usize,
        concat!("Size of: ", stringify!(__guest_handle_64_uint64))
    );
    assert_eq!(
        ::std::mem::align_of::<__guest_handle_64_uint64>(),
        8usize,
        concat!("Alignment of ", stringify!(__guest_handle_64_uint64))
    );
    fn test_field_p() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<__guest_handle_64_uint64>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).p) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(__guest_handle_64_uint64),
                "::",
                stringify!(p)
            )
        );
    }
    test_field_p();
    fn test_field_q() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<__guest_handle_64_uint64>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).q) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(__guest_handle_64_uint64),
                "::",
                stringify!(q)
            )
        );
    }
    test_field_q();
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union __guest_handle_const_uint64 {
    pub p: *const u64,
    pub q: ::std::os::raw::c_ulong,
}
#[test]
fn bindgen_test_layout___guest_handle_const_uint64() {
    assert_eq!(
        ::std::mem::size_of::<__guest_handle_const_uint64>(),
        8usize,
        concat!("Size of: ", stringify!(__guest_handle_const_uint64))
    );
    assert_eq!(
        ::std::mem::align_of::<__guest_handle_const_uint64>(),
        8usize,
        concat!("Alignment of ", stringify!(__guest_handle_const_uint64))
    );
    fn test_field_p() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<__guest_handle_const_uint64>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).p) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(__guest_handle_const_uint64),
                "::",
                stringify!(p)
            )
        );
    }
    test_field_p();
    fn test_field_q() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<__guest_handle_const_uint64>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).q) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(__guest_handle_const_uint64),
                "::",
                stringify!(q)
            )
        );
    }
    test_field_q();
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union __guest_handle_64_const_uint64 {
    pub p: *const u64,
    pub q: u64,
}
#[test]
fn bindgen_test_layout___guest_handle_64_const_uint64() {
    assert_eq!(
        ::std::mem::size_of::<__guest_handle_64_const_uint64>(),
        8usize,
        concat!("Size of: ", stringify!(__guest_handle_64_const_uint64))
    );
    assert_eq!(
        ::std::mem::align_of::<__guest_handle_64_const_uint64>(),
        8usize,
        concat!("Alignment of ", stringify!(__guest_handle_64_const_uint64))
    );
    fn test_field_p() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<__guest_handle_64_const_uint64>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).p) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(__guest_handle_64_const_uint64),
                "::",
                stringify!(p)
            )
        );
    }
    test_field_p();
    fn test_field_q() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<__guest_handle_64_const_uint64>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).q) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(__guest_handle_64_const_uint64),
                "::",
                stringify!(q)
            )
        );
    }
    test_field_q();
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xen_uuid_t {
    pub a: [u8; 16usize],
}
#[test]
fn bindgen_test_layout_xen_uuid_t() {
    assert_eq!(
        ::std::mem::size_of::<xen_uuid_t>(),
        16usize,
        concat!("Size of: ", stringify!(xen_uuid_t))
    );
    assert_eq!(
        ::std::mem::align_of::<xen_uuid_t>(),
        1usize,
        concat!("Alignment of ", stringify!(xen_uuid_t))
    );
    fn test_field_a() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<xen_uuid_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).a) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(xen_uuid_t),
                "::",
                stringify!(a)
            )
        );
    }
    test_field_a();
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct xenctl_bitmap {
    pub bitmap: __guest_handle_64_uint8,
    pub nr_bits: u32,
}
#[test]
fn bindgen_test_layout_xenctl_bitmap() {
    assert_eq!(
        ::std::mem::size_of::<xenctl_bitmap>(),
        16usize,
        concat!("Size of: ", stringify!(xenctl_bitmap))
    );
    assert_eq!(
        ::std::mem::align_of::<xenctl_bitmap>(),
        8usize,
        concat!("Alignment of ", stringify!(xenctl_bitmap))
    );
    fn test_field_bitmap() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<xenctl_bitmap>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).bitmap) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(xenctl_bitmap),
                "::",
                stringify!(bitmap)
            )
        );
    }
    test_field_bitmap();
    fn test_field_nr_bits() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<xenctl_bitmap>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).nr_bits) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(xenctl_bitmap),
                "::",
                stringify!(nr_bits)
            )
        );
    }
    test_field_nr_bits();
}
pub type xenctl_bitmap_t = xenctl_bitmap;
pub type evtchn_port_t = u32;
#[repr(C)]
#[derive(Copy, Clone)]
pub union __guest_handle_evtchn_port_t {
    pub p: *mut evtchn_port_t,
    pub q: ::std::os::raw::c_ulong,
}
#[test]
fn bindgen_test_layout___guest_handle_evtchn_port_t() {
    assert_eq!(
        ::std::mem::size_of::<__guest_handle_evtchn_port_t>(),
        8usize,
        concat!("Size of: ", stringify!(__guest_handle_evtchn_port_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__guest_handle_evtchn_port_t>(),
        8usize,
        concat!("Alignment of ", stringify!(__guest_handle_evtchn_port_t))
    );
    fn test_field_p() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<__guest_handle_evtchn_port_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).p) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(__guest_handle_evtchn_port_t),
                "::",
                stringify!(p)
            )
        );
    }
    test_field_p();
    fn test_field_q() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<__guest_handle_evtchn_port_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).q) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(__guest_handle_evtchn_port_t),
                "::",
                stringify!(q)
            )
        );
    }
    test_field_q();
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union __guest_handle_64_evtchn_port_t {
    pub p: *mut evtchn_port_t,
    pub q: u64,
}
#[test]
fn bindgen_test_layout___guest_handle_64_evtchn_port_t() {
    assert_eq!(
        ::std::mem::size_of::<__guest_handle_64_evtchn_port_t>(),
        8usize,
        concat!("Size of: ", stringify!(__guest_handle_64_evtchn_port_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__guest_handle_64_evtchn_port_t>(),
        8usize,
        concat!("Alignment of ", stringify!(__guest_handle_64_evtchn_port_t))
    );
    fn test_field_p() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<__guest_handle_64_evtchn_port_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).p) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(__guest_handle_64_evtchn_port_t),
                "::",
                stringify!(p)
            )
        );
    }
    test_field_p();
    fn test_field_q() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<__guest_handle_64_evtchn_port_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).q) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(__guest_handle_64_evtchn_port_t),
                "::",
                stringify!(q)
            )
        );
    }
    test_field_q();
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union __guest_handle_const_evtchn_port_t {
    pub p: *const evtchn_port_t,
    pub q: ::std::os::raw::c_ulong,
}
#[test]
fn bindgen_test_layout___guest_handle_const_evtchn_port_t() {
    assert_eq!(
        ::std::mem::size_of::<__guest_handle_const_evtchn_port_t>(),
        8usize,
        concat!("Size of: ", stringify!(__guest_handle_const_evtchn_port_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__guest_handle_const_evtchn_port_t>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(__guest_handle_const_evtchn_port_t)
        )
    );
    fn test_field_p() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<__guest_handle_const_evtchn_port_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).p) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(__guest_handle_const_evtchn_port_t),
                "::",
                stringify!(p)
            )
        );
    }
    test_field_p();
    fn test_field_q() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<__guest_handle_const_evtchn_port_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).q) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(__guest_handle_const_evtchn_port_t),
                "::",
                stringify!(q)
            )
        );
    }
    test_field_q();
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union __guest_handle_64_const_evtchn_port_t {
    pub p: *const evtchn_port_t,
    pub q: u64,
}
#[test]
fn bindgen_test_layout___guest_handle_64_const_evtchn_port_t() {
    assert_eq!(
        ::std::mem::size_of::<__guest_handle_64_const_evtchn_port_t>(),
        8usize,
        concat!(
            "Size of: ",
            stringify!(__guest_handle_64_const_evtchn_port_t)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<__guest_handle_64_const_evtchn_port_t>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(__guest_handle_64_const_evtchn_port_t)
        )
    );
    fn test_field_p() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<__guest_handle_64_const_evtchn_port_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).p) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(__guest_handle_64_const_evtchn_port_t),
                "::",
                stringify!(p)
            )
        );
    }
    test_field_p();
    fn test_field_q() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<__guest_handle_64_const_evtchn_port_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).q) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(__guest_handle_64_const_evtchn_port_t),
                "::",
                stringify!(q)
            )
        );
    }
    test_field_q();
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct evtchn_alloc_unbound {
    pub dom: domid_t,
    pub remote_dom: domid_t,
    pub port: evtchn_port_t,
}
#[test]
fn bindgen_test_layout_evtchn_alloc_unbound() {
    assert_eq!(
        ::std::mem::size_of::<evtchn_alloc_unbound>(),
        8usize,
        concat!("Size of: ", stringify!(evtchn_alloc_unbound))
    );
    assert_eq!(
        ::std::mem::align_of::<evtchn_alloc_unbound>(),
        4usize,
        concat!("Alignment of ", stringify!(evtchn_alloc_unbound))
    );
    fn test_field_dom() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<evtchn_alloc_unbound>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).dom) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(evtchn_alloc_unbound),
                "::",
                stringify!(dom)
            )
        );
    }
    test_field_dom();
    fn test_field_remote_dom() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<evtchn_alloc_unbound>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).remote_dom) as usize - ptr as usize
            },
            2usize,
            concat!(
                "Offset of field: ",
                stringify!(evtchn_alloc_unbound),
                "::",
                stringify!(remote_dom)
            )
        );
    }
    test_field_remote_dom();
    fn test_field_port() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<evtchn_alloc_unbound>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).port) as usize - ptr as usize
            },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(evtchn_alloc_unbound),
                "::",
                stringify!(port)
            )
        );
    }
    test_field_port();
}
pub type evtchn_alloc_unbound_t = evtchn_alloc_unbound;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct evtchn_bind_interdomain {
    pub remote_dom: domid_t,
    pub remote_port: evtchn_port_t,
    pub local_port: evtchn_port_t,
}
#[test]
fn bindgen_test_layout_evtchn_bind_interdomain() {
    assert_eq!(
        ::std::mem::size_of::<evtchn_bind_interdomain>(),
        12usize,
        concat!("Size of: ", stringify!(evtchn_bind_interdomain))
    );
    assert_eq!(
        ::std::mem::align_of::<evtchn_bind_interdomain>(),
        4usize,
        concat!("Alignment of ", stringify!(evtchn_bind_interdomain))
    );
    fn test_field_remote_dom() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<evtchn_bind_interdomain>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).remote_dom) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(evtchn_bind_interdomain),
                "::",
                stringify!(remote_dom)
            )
        );
    }
    test_field_remote_dom();
    fn test_field_remote_port() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<evtchn_bind_interdomain>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).remote_port) as usize - ptr as usize
            },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(evtchn_bind_interdomain),
                "::",
                stringify!(remote_port)
            )
        );
    }
    test_field_remote_port();
    fn test_field_local_port() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<evtchn_bind_interdomain>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).local_port) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(evtchn_bind_interdomain),
                "::",
                stringify!(local_port)
            )
        );
    }
    test_field_local_port();
}
pub type evtchn_bind_interdomain_t = evtchn_bind_interdomain;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct evtchn_bind_virq {
    pub virq: u32,
    pub vcpu: u32,
    pub port: evtchn_port_t,
}
#[test]
fn bindgen_test_layout_evtchn_bind_virq() {
    assert_eq!(
        ::std::mem::size_of::<evtchn_bind_virq>(),
        12usize,
        concat!("Size of: ", stringify!(evtchn_bind_virq))
    );
    assert_eq!(
        ::std::mem::align_of::<evtchn_bind_virq>(),
        4usize,
        concat!("Alignment of ", stringify!(evtchn_bind_virq))
    );
    fn test_field_virq() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<evtchn_bind_virq>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).virq) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(evtchn_bind_virq),
                "::",
                stringify!(virq)
            )
        );
    }
    test_field_virq();
    fn test_field_vcpu() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<evtchn_bind_virq>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).vcpu) as usize - ptr as usize
            },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(evtchn_bind_virq),
                "::",
                stringify!(vcpu)
            )
        );
    }
    test_field_vcpu();
    fn test_field_port() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<evtchn_bind_virq>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).port) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(evtchn_bind_virq),
                "::",
                stringify!(port)
            )
        );
    }
    test_field_port();
}
pub type evtchn_bind_virq_t = evtchn_bind_virq;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct evtchn_bind_pirq {
    pub pirq: u32,
    pub flags: u32,
    pub port: evtchn_port_t,
}
#[test]
fn bindgen_test_layout_evtchn_bind_pirq() {
    assert_eq!(
        ::std::mem::size_of::<evtchn_bind_pirq>(),
        12usize,
        concat!("Size of: ", stringify!(evtchn_bind_pirq))
    );
    assert_eq!(
        ::std::mem::align_of::<evtchn_bind_pirq>(),
        4usize,
        concat!("Alignment of ", stringify!(evtchn_bind_pirq))
    );
    fn test_field_pirq() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<evtchn_bind_pirq>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).pirq) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(evtchn_bind_pirq),
                "::",
                stringify!(pirq)
            )
        );
    }
    test_field_pirq();
    fn test_field_flags() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<evtchn_bind_pirq>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).flags) as usize - ptr as usize
            },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(evtchn_bind_pirq),
                "::",
                stringify!(flags)
            )
        );
    }
    test_field_flags();
    fn test_field_port() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<evtchn_bind_pirq>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).port) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(evtchn_bind_pirq),
                "::",
                stringify!(port)
            )
        );
    }
    test_field_port();
}
pub type evtchn_bind_pirq_t = evtchn_bind_pirq;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct evtchn_bind_ipi {
    pub vcpu: u32,
    pub port: evtchn_port_t,
}
#[test]
fn bindgen_test_layout_evtchn_bind_ipi() {
    assert_eq!(
        ::std::mem::size_of::<evtchn_bind_ipi>(),
        8usize,
        concat!("Size of: ", stringify!(evtchn_bind_ipi))
    );
    assert_eq!(
        ::std::mem::align_of::<evtchn_bind_ipi>(),
        4usize,
        concat!("Alignment of ", stringify!(evtchn_bind_ipi))
    );
    fn test_field_vcpu() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<evtchn_bind_ipi>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).vcpu) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(evtchn_bind_ipi),
                "::",
                stringify!(vcpu)
            )
        );
    }
    test_field_vcpu();
    fn test_field_port() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<evtchn_bind_ipi>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).port) as usize - ptr as usize
            },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(evtchn_bind_ipi),
                "::",
                stringify!(port)
            )
        );
    }
    test_field_port();
}
pub type evtchn_bind_ipi_t = evtchn_bind_ipi;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct evtchn_close {
    pub port: evtchn_port_t,
}
#[test]
fn bindgen_test_layout_evtchn_close() {
    assert_eq!(
        ::std::mem::size_of::<evtchn_close>(),
        4usize,
        concat!("Size of: ", stringify!(evtchn_close))
    );
    assert_eq!(
        ::std::mem::align_of::<evtchn_close>(),
        4usize,
        concat!("Alignment of ", stringify!(evtchn_close))
    );
    fn test_field_port() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<evtchn_close>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).port) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(evtchn_close),
                "::",
                stringify!(port)
            )
        );
    }
    test_field_port();
}
pub type evtchn_close_t = evtchn_close;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct evtchn_send {
    pub port: evtchn_port_t,
}
#[test]
fn bindgen_test_layout_evtchn_send() {
    assert_eq!(
        ::std::mem::size_of::<evtchn_send>(),
        4usize,
        concat!("Size of: ", stringify!(evtchn_send))
    );
    assert_eq!(
        ::std::mem::align_of::<evtchn_send>(),
        4usize,
        concat!("Alignment of ", stringify!(evtchn_send))
    );
    fn test_field_port() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<evtchn_send>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).port) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(evtchn_send),
                "::",
                stringify!(port)
            )
        );
    }
    test_field_port();
}
pub type evtchn_send_t = evtchn_send;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct evtchn_status {
    pub dom: domid_t,
    pub port: evtchn_port_t,
    pub status: u32,
    pub vcpu: u32,
    pub u: evtchn_status__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union evtchn_status__bindgen_ty_1 {
    pub unbound: evtchn_status__bindgen_ty_1__bindgen_ty_1,
    pub interdomain: evtchn_status__bindgen_ty_1__bindgen_ty_2,
    pub pirq: u32,
    pub virq: u32,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct evtchn_status__bindgen_ty_1__bindgen_ty_1 {
    pub dom: domid_t,
}
#[test]
fn bindgen_test_layout_evtchn_status__bindgen_ty_1__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<evtchn_status__bindgen_ty_1__bindgen_ty_1>(),
        2usize,
        concat!(
            "Size of: ",
            stringify!(evtchn_status__bindgen_ty_1__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<evtchn_status__bindgen_ty_1__bindgen_ty_1>(),
        2usize,
        concat!(
            "Alignment of ",
            stringify!(evtchn_status__bindgen_ty_1__bindgen_ty_1)
        )
    );
    fn test_field_dom() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<evtchn_status__bindgen_ty_1__bindgen_ty_1>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).dom) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(evtchn_status__bindgen_ty_1__bindgen_ty_1),
                "::",
                stringify!(dom)
            )
        );
    }
    test_field_dom();
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct evtchn_status__bindgen_ty_1__bindgen_ty_2 {
    pub dom: domid_t,
    pub port: evtchn_port_t,
}
#[test]
fn bindgen_test_layout_evtchn_status__bindgen_ty_1__bindgen_ty_2() {
    assert_eq!(
        ::std::mem::size_of::<evtchn_status__bindgen_ty_1__bindgen_ty_2>(),
        8usize,
        concat!(
            "Size of: ",
            stringify!(evtchn_status__bindgen_ty_1__bindgen_ty_2)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<evtchn_status__bindgen_ty_1__bindgen_ty_2>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(evtchn_status__bindgen_ty_1__bindgen_ty_2)
        )
    );
    fn test_field_dom() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<evtchn_status__bindgen_ty_1__bindgen_ty_2>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).dom) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(evtchn_status__bindgen_ty_1__bindgen_ty_2),
                "::",
                stringify!(dom)
            )
        );
    }
    test_field_dom();
    fn test_field_port() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<evtchn_status__bindgen_ty_1__bindgen_ty_2>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).port) as usize - ptr as usize
            },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(evtchn_status__bindgen_ty_1__bindgen_ty_2),
                "::",
                stringify!(port)
            )
        );
    }
    test_field_port();
}
#[test]
fn bindgen_test_layout_evtchn_status__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<evtchn_status__bindgen_ty_1>(),
        8usize,
        concat!("Size of: ", stringify!(evtchn_status__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<evtchn_status__bindgen_ty_1>(),
        4usize,
        concat!("Alignment of ", stringify!(evtchn_status__bindgen_ty_1))
    );
    fn test_field_unbound() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<evtchn_status__bindgen_ty_1>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).unbound) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(evtchn_status__bindgen_ty_1),
                "::",
                stringify!(unbound)
            )
        );
    }
    test_field_unbound();
    fn test_field_interdomain() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<evtchn_status__bindgen_ty_1>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).interdomain) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(evtchn_status__bindgen_ty_1),
                "::",
                stringify!(interdomain)
            )
        );
    }
    test_field_interdomain();
    fn test_field_pirq() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<evtchn_status__bindgen_ty_1>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).pirq) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(evtchn_status__bindgen_ty_1),
                "::",
                stringify!(pirq)
            )
        );
    }
    test_field_pirq();
    fn test_field_virq() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<evtchn_status__bindgen_ty_1>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).virq) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(evtchn_status__bindgen_ty_1),
                "::",
                stringify!(virq)
            )
        );
    }
    test_field_virq();
}
#[test]
fn bindgen_test_layout_evtchn_status() {
    assert_eq!(
        ::std::mem::size_of::<evtchn_status>(),
        24usize,
        concat!("Size of: ", stringify!(evtchn_status))
    );
    assert_eq!(
        ::std::mem::align_of::<evtchn_status>(),
        4usize,
        concat!("Alignment of ", stringify!(evtchn_status))
    );
    fn test_field_dom() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<evtchn_status>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).dom) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(evtchn_status),
                "::",
                stringify!(dom)
            )
        );
    }
    test_field_dom();
    fn test_field_port() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<evtchn_status>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).port) as usize - ptr as usize
            },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(evtchn_status),
                "::",
                stringify!(port)
            )
        );
    }
    test_field_port();
    fn test_field_status() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<evtchn_status>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).status) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(evtchn_status),
                "::",
                stringify!(status)
            )
        );
    }
    test_field_status();
    fn test_field_vcpu() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<evtchn_status>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).vcpu) as usize - ptr as usize
            },
            12usize,
            concat!(
                "Offset of field: ",
                stringify!(evtchn_status),
                "::",
                stringify!(vcpu)
            )
        );
    }
    test_field_vcpu();
    fn test_field_u() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<evtchn_status>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).u) as usize - ptr as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(evtchn_status),
                "::",
                stringify!(u)
            )
        );
    }
    test_field_u();
}
pub type evtchn_status_t = evtchn_status;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct evtchn_bind_vcpu {
    pub port: evtchn_port_t,
    pub vcpu: u32,
}
#[test]
fn bindgen_test_layout_evtchn_bind_vcpu() {
    assert_eq!(
        ::std::mem::size_of::<evtchn_bind_vcpu>(),
        8usize,
        concat!("Size of: ", stringify!(evtchn_bind_vcpu))
    );
    assert_eq!(
        ::std::mem::align_of::<evtchn_bind_vcpu>(),
        4usize,
        concat!("Alignment of ", stringify!(evtchn_bind_vcpu))
    );
    fn test_field_port() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<evtchn_bind_vcpu>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).port) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(evtchn_bind_vcpu),
                "::",
                stringify!(port)
            )
        );
    }
    test_field_port();
    fn test_field_vcpu() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<evtchn_bind_vcpu>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).vcpu) as usize - ptr as usize
            },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(evtchn_bind_vcpu),
                "::",
                stringify!(vcpu)
            )
        );
    }
    test_field_vcpu();
}
pub type evtchn_bind_vcpu_t = evtchn_bind_vcpu;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct evtchn_unmask {
    pub port: evtchn_port_t,
}
#[test]
fn bindgen_test_layout_evtchn_unmask() {
    assert_eq!(
        ::std::mem::size_of::<evtchn_unmask>(),
        4usize,
        concat!("Size of: ", stringify!(evtchn_unmask))
    );
    assert_eq!(
        ::std::mem::align_of::<evtchn_unmask>(),
        4usize,
        concat!("Alignment of ", stringify!(evtchn_unmask))
    );
    fn test_field_port() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<evtchn_unmask>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).port) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(evtchn_unmask),
                "::",
                stringify!(port)
            )
        );
    }
    test_field_port();
}
pub type evtchn_unmask_t = evtchn_unmask;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct evtchn_reset {
    pub dom: domid_t,
}
#[test]
fn bindgen_test_layout_evtchn_reset() {
    assert_eq!(
        ::std::mem::size_of::<evtchn_reset>(),
        2usize,
        concat!("Size of: ", stringify!(evtchn_reset))
    );
    assert_eq!(
        ::std::mem::align_of::<evtchn_reset>(),
        2usize,
        concat!("Alignment of ", stringify!(evtchn_reset))
    );
    fn test_field_dom() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<evtchn_reset>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).dom) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(evtchn_reset),
                "::",
                stringify!(dom)
            )
        );
    }
    test_field_dom();
}
pub type evtchn_reset_t = evtchn_reset;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct evtchn_init_control {
    pub control_gfn: u64,
    pub offset: u32,
    pub vcpu: u32,
    pub link_bits: u8,
    pub _pad: [u8; 7usize],
}
#[test]
fn bindgen_test_layout_evtchn_init_control() {
    assert_eq!(
        ::std::mem::size_of::<evtchn_init_control>(),
        24usize,
        concat!("Size of: ", stringify!(evtchn_init_control))
    );
    assert_eq!(
        ::std::mem::align_of::<evtchn_init_control>(),
        8usize,
        concat!("Alignment of ", stringify!(evtchn_init_control))
    );
    fn test_field_control_gfn() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<evtchn_init_control>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).control_gfn) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(evtchn_init_control),
                "::",
                stringify!(control_gfn)
            )
        );
    }
    test_field_control_gfn();
    fn test_field_offset() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<evtchn_init_control>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).offset) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(evtchn_init_control),
                "::",
                stringify!(offset)
            )
        );
    }
    test_field_offset();
    fn test_field_vcpu() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<evtchn_init_control>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).vcpu) as usize - ptr as usize
            },
            12usize,
            concat!(
                "Offset of field: ",
                stringify!(evtchn_init_control),
                "::",
                stringify!(vcpu)
            )
        );
    }
    test_field_vcpu();
    fn test_field_link_bits() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<evtchn_init_control>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).link_bits) as usize - ptr as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(evtchn_init_control),
                "::",
                stringify!(link_bits)
            )
        );
    }
    test_field_link_bits();
    fn test_field__pad() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<evtchn_init_control>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr)._pad) as usize - ptr as usize
            },
            17usize,
            concat!(
                "Offset of field: ",
                stringify!(evtchn_init_control),
                "::",
                stringify!(_pad)
            )
        );
    }
    test_field__pad();
}
pub type evtchn_init_control_t = evtchn_init_control;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct evtchn_expand_array {
    pub array_gfn: u64,
}
#[test]
fn bindgen_test_layout_evtchn_expand_array() {
    assert_eq!(
        ::std::mem::size_of::<evtchn_expand_array>(),
        8usize,
        concat!("Size of: ", stringify!(evtchn_expand_array))
    );
    assert_eq!(
        ::std::mem::align_of::<evtchn_expand_array>(),
        8usize,
        concat!("Alignment of ", stringify!(evtchn_expand_array))
    );
    fn test_field_array_gfn() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<evtchn_expand_array>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).array_gfn) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(evtchn_expand_array),
                "::",
                stringify!(array_gfn)
            )
        );
    }
    test_field_array_gfn();
}
pub type evtchn_expand_array_t = evtchn_expand_array;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct evtchn_set_priority {
    pub port: evtchn_port_t,
    pub priority: u32,
}
#[test]
fn bindgen_test_layout_evtchn_set_priority() {
    assert_eq!(
        ::std::mem::size_of::<evtchn_set_priority>(),
        8usize,
        concat!("Size of: ", stringify!(evtchn_set_priority))
    );
    assert_eq!(
        ::std::mem::align_of::<evtchn_set_priority>(),
        4usize,
        concat!("Alignment of ", stringify!(evtchn_set_priority))
    );
    fn test_field_port() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<evtchn_set_priority>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).port) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(evtchn_set_priority),
                "::",
                stringify!(port)
            )
        );
    }
    test_field_port();
    fn test_field_priority() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<evtchn_set_priority>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).priority) as usize - ptr as usize
            },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(evtchn_set_priority),
                "::",
                stringify!(priority)
            )
        );
    }
    test_field_priority();
}
pub type evtchn_set_priority_t = evtchn_set_priority;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct evtchn_op {
    pub cmd: u32,
    pub u: evtchn_op__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union evtchn_op__bindgen_ty_1 {
    pub alloc_unbound: evtchn_alloc_unbound_t,
    pub bind_interdomain: evtchn_bind_interdomain_t,
    pub bind_virq: evtchn_bind_virq_t,
    pub bind_pirq: evtchn_bind_pirq_t,
    pub bind_ipi: evtchn_bind_ipi_t,
    pub close: evtchn_close_t,
    pub send: evtchn_send_t,
    pub status: evtchn_status_t,
    pub bind_vcpu: evtchn_bind_vcpu_t,
    pub unmask: evtchn_unmask_t,
}
#[test]
fn bindgen_test_layout_evtchn_op__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<evtchn_op__bindgen_ty_1>(),
        24usize,
        concat!("Size of: ", stringify!(evtchn_op__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<evtchn_op__bindgen_ty_1>(),
        4usize,
        concat!("Alignment of ", stringify!(evtchn_op__bindgen_ty_1))
    );
    fn test_field_alloc_unbound() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<evtchn_op__bindgen_ty_1>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).alloc_unbound) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(evtchn_op__bindgen_ty_1),
                "::",
                stringify!(alloc_unbound)
            )
        );
    }
    test_field_alloc_unbound();
    fn test_field_bind_interdomain() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<evtchn_op__bindgen_ty_1>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).bind_interdomain) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(evtchn_op__bindgen_ty_1),
                "::",
                stringify!(bind_interdomain)
            )
        );
    }
    test_field_bind_interdomain();
    fn test_field_bind_virq() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<evtchn_op__bindgen_ty_1>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).bind_virq) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(evtchn_op__bindgen_ty_1),
                "::",
                stringify!(bind_virq)
            )
        );
    }
    test_field_bind_virq();
    fn test_field_bind_pirq() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<evtchn_op__bindgen_ty_1>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).bind_pirq) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(evtchn_op__bindgen_ty_1),
                "::",
                stringify!(bind_pirq)
            )
        );
    }
    test_field_bind_pirq();
    fn test_field_bind_ipi() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<evtchn_op__bindgen_ty_1>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).bind_ipi) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(evtchn_op__bindgen_ty_1),
                "::",
                stringify!(bind_ipi)
            )
        );
    }
    test_field_bind_ipi();
    fn test_field_close() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<evtchn_op__bindgen_ty_1>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).close) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(evtchn_op__bindgen_ty_1),
                "::",
                stringify!(close)
            )
        );
    }
    test_field_close();
    fn test_field_send() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<evtchn_op__bindgen_ty_1>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).send) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(evtchn_op__bindgen_ty_1),
                "::",
                stringify!(send)
            )
        );
    }
    test_field_send();
    fn test_field_status() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<evtchn_op__bindgen_ty_1>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).status) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(evtchn_op__bindgen_ty_1),
                "::",
                stringify!(status)
            )
        );
    }
    test_field_status();
    fn test_field_bind_vcpu() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<evtchn_op__bindgen_ty_1>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).bind_vcpu) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(evtchn_op__bindgen_ty_1),
                "::",
                stringify!(bind_vcpu)
            )
        );
    }
    test_field_bind_vcpu();
    fn test_field_unmask() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<evtchn_op__bindgen_ty_1>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).unmask) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(evtchn_op__bindgen_ty_1),
                "::",
                stringify!(unmask)
            )
        );
    }
    test_field_unmask();
}
#[test]
fn bindgen_test_layout_evtchn_op() {
    assert_eq!(
        ::std::mem::size_of::<evtchn_op>(),
        28usize,
        concat!("Size of: ", stringify!(evtchn_op))
    );
    assert_eq!(
        ::std::mem::align_of::<evtchn_op>(),
        4usize,
        concat!("Alignment of ", stringify!(evtchn_op))
    );
    fn test_field_cmd() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<evtchn_op>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).cmd) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(evtchn_op),
                "::",
                stringify!(cmd)
            )
        );
    }
    test_field_cmd();
    fn test_field_u() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<evtchn_op>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).u) as usize - ptr as usize
            },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(evtchn_op),
                "::",
                stringify!(u)
            )
        );
    }
    test_field_u();
}
pub type evtchn_op_t = evtchn_op;
#[repr(C)]
#[derive(Copy, Clone)]
pub union __guest_handle_evtchn_op_t {
    pub p: *mut evtchn_op_t,
    pub q: ::std::os::raw::c_ulong,
}
#[test]
fn bindgen_test_layout___guest_handle_evtchn_op_t() {
    assert_eq!(
        ::std::mem::size_of::<__guest_handle_evtchn_op_t>(),
        8usize,
        concat!("Size of: ", stringify!(__guest_handle_evtchn_op_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__guest_handle_evtchn_op_t>(),
        8usize,
        concat!("Alignment of ", stringify!(__guest_handle_evtchn_op_t))
    );
    fn test_field_p() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<__guest_handle_evtchn_op_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).p) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(__guest_handle_evtchn_op_t),
                "::",
                stringify!(p)
            )
        );
    }
    test_field_p();
    fn test_field_q() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<__guest_handle_evtchn_op_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).q) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(__guest_handle_evtchn_op_t),
                "::",
                stringify!(q)
            )
        );
    }
    test_field_q();
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union __guest_handle_64_evtchn_op_t {
    pub p: *mut evtchn_op_t,
    pub q: u64,
}
#[test]
fn bindgen_test_layout___guest_handle_64_evtchn_op_t() {
    assert_eq!(
        ::std::mem::size_of::<__guest_handle_64_evtchn_op_t>(),
        8usize,
        concat!("Size of: ", stringify!(__guest_handle_64_evtchn_op_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__guest_handle_64_evtchn_op_t>(),
        8usize,
        concat!("Alignment of ", stringify!(__guest_handle_64_evtchn_op_t))
    );
    fn test_field_p() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<__guest_handle_64_evtchn_op_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).p) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(__guest_handle_64_evtchn_op_t),
                "::",
                stringify!(p)
            )
        );
    }
    test_field_p();
    fn test_field_q() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<__guest_handle_64_evtchn_op_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).q) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(__guest_handle_64_evtchn_op_t),
                "::",
                stringify!(q)
            )
        );
    }
    test_field_q();
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union __guest_handle_const_evtchn_op_t {
    pub p: *const evtchn_op_t,
    pub q: ::std::os::raw::c_ulong,
}
#[test]
fn bindgen_test_layout___guest_handle_const_evtchn_op_t() {
    assert_eq!(
        ::std::mem::size_of::<__guest_handle_const_evtchn_op_t>(),
        8usize,
        concat!("Size of: ", stringify!(__guest_handle_const_evtchn_op_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__guest_handle_const_evtchn_op_t>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(__guest_handle_const_evtchn_op_t)
        )
    );
    fn test_field_p() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<__guest_handle_const_evtchn_op_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).p) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(__guest_handle_const_evtchn_op_t),
                "::",
                stringify!(p)
            )
        );
    }
    test_field_p();
    fn test_field_q() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<__guest_handle_const_evtchn_op_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).q) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(__guest_handle_const_evtchn_op_t),
                "::",
                stringify!(q)
            )
        );
    }
    test_field_q();
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union __guest_handle_64_const_evtchn_op_t {
    pub p: *const evtchn_op_t,
    pub q: u64,
}
#[test]
fn bindgen_test_layout___guest_handle_64_const_evtchn_op_t() {
    assert_eq!(
        ::std::mem::size_of::<__guest_handle_64_const_evtchn_op_t>(),
        8usize,
        concat!("Size of: ", stringify!(__guest_handle_64_const_evtchn_op_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__guest_handle_64_const_evtchn_op_t>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(__guest_handle_64_const_evtchn_op_t)
        )
    );
    fn test_field_p() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<__guest_handle_64_const_evtchn_op_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).p) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(__guest_handle_64_const_evtchn_op_t),
                "::",
                stringify!(p)
            )
        );
    }
    test_field_p();
    fn test_field_q() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<__guest_handle_64_const_evtchn_op_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).q) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(__guest_handle_64_const_evtchn_op_t),
                "::",
                stringify!(q)
            )
        );
    }
    test_field_q();
}
pub type event_word_t = u32;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct evtchn_fifo_control_block {
    pub ready: u32,
    pub _rsvd: u32,
    pub head: [u32; 16usize],
}
#[test]
fn bindgen_test_layout_evtchn_fifo_control_block() {
    assert_eq!(
        ::std::mem::size_of::<evtchn_fifo_control_block>(),
        72usize,
        concat!("Size of: ", stringify!(evtchn_fifo_control_block))
    );
    assert_eq!(
        ::std::mem::align_of::<evtchn_fifo_control_block>(),
        4usize,
        concat!("Alignment of ", stringify!(evtchn_fifo_control_block))
    );
    fn test_field_ready() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<evtchn_fifo_control_block>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).ready) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(evtchn_fifo_control_block),
                "::",
                stringify!(ready)
            )
        );
    }
    test_field_ready();
    fn test_field__rsvd() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<evtchn_fifo_control_block>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr)._rsvd) as usize - ptr as usize
            },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(evtchn_fifo_control_block),
                "::",
                stringify!(_rsvd)
            )
        );
    }
    test_field__rsvd();
    fn test_field_head() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<evtchn_fifo_control_block>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).head) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(evtchn_fifo_control_block),
                "::",
                stringify!(head)
            )
        );
    }
    test_field_head();
}
pub type evtchn_fifo_control_block_t = evtchn_fifo_control_block;
pub type grant_ref_t = u32;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct grant_entry_v1 {
    pub flags: u16,
    pub domid: domid_t,
    pub frame: u32,
}
#[test]
fn bindgen_test_layout_grant_entry_v1() {
    assert_eq!(
        ::std::mem::size_of::<grant_entry_v1>(),
        8usize,
        concat!("Size of: ", stringify!(grant_entry_v1))
    );
    assert_eq!(
        ::std::mem::align_of::<grant_entry_v1>(),
        4usize,
        concat!("Alignment of ", stringify!(grant_entry_v1))
    );
    fn test_field_flags() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<grant_entry_v1>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).flags) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(grant_entry_v1),
                "::",
                stringify!(flags)
            )
        );
    }
    test_field_flags();
    fn test_field_domid() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<grant_entry_v1>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).domid) as usize - ptr as usize
            },
            2usize,
            concat!(
                "Offset of field: ",
                stringify!(grant_entry_v1),
                "::",
                stringify!(domid)
            )
        );
    }
    test_field_domid();
    fn test_field_frame() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<grant_entry_v1>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).frame) as usize - ptr as usize
            },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(grant_entry_v1),
                "::",
                stringify!(frame)
            )
        );
    }
    test_field_frame();
}
pub type grant_entry_v1_t = grant_entry_v1;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct grant_entry_header {
    pub flags: u16,
    pub domid: domid_t,
}
#[test]
fn bindgen_test_layout_grant_entry_header() {
    assert_eq!(
        ::std::mem::size_of::<grant_entry_header>(),
        4usize,
        concat!("Size of: ", stringify!(grant_entry_header))
    );
    assert_eq!(
        ::std::mem::align_of::<grant_entry_header>(),
        2usize,
        concat!("Alignment of ", stringify!(grant_entry_header))
    );
    fn test_field_flags() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<grant_entry_header>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).flags) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(grant_entry_header),
                "::",
                stringify!(flags)
            )
        );
    }
    test_field_flags();
    fn test_field_domid() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<grant_entry_header>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).domid) as usize - ptr as usize
            },
            2usize,
            concat!(
                "Offset of field: ",
                stringify!(grant_entry_header),
                "::",
                stringify!(domid)
            )
        );
    }
    test_field_domid();
}
pub type grant_entry_header_t = grant_entry_header;
#[repr(C)]
#[derive(Copy, Clone)]
pub union grant_entry_v2 {
    pub hdr: grant_entry_header_t,
    pub full_page: grant_entry_v2__bindgen_ty_1,
    pub sub_page: grant_entry_v2__bindgen_ty_2,
    pub transitive: grant_entry_v2__bindgen_ty_3,
    pub __spacer: [u32; 4usize],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct grant_entry_v2__bindgen_ty_1 {
    pub hdr: grant_entry_header_t,
    pub pad0: u32,
    pub frame: u64,
}
#[test]
fn bindgen_test_layout_grant_entry_v2__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<grant_entry_v2__bindgen_ty_1>(),
        16usize,
        concat!("Size of: ", stringify!(grant_entry_v2__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<grant_entry_v2__bindgen_ty_1>(),
        8usize,
        concat!("Alignment of ", stringify!(grant_entry_v2__bindgen_ty_1))
    );
    fn test_field_hdr() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<grant_entry_v2__bindgen_ty_1>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).hdr) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(grant_entry_v2__bindgen_ty_1),
                "::",
                stringify!(hdr)
            )
        );
    }
    test_field_hdr();
    fn test_field_pad0() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<grant_entry_v2__bindgen_ty_1>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).pad0) as usize - ptr as usize
            },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(grant_entry_v2__bindgen_ty_1),
                "::",
                stringify!(pad0)
            )
        );
    }
    test_field_pad0();
    fn test_field_frame() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<grant_entry_v2__bindgen_ty_1>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).frame) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(grant_entry_v2__bindgen_ty_1),
                "::",
                stringify!(frame)
            )
        );
    }
    test_field_frame();
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct grant_entry_v2__bindgen_ty_2 {
    pub hdr: grant_entry_header_t,
    pub page_off: u16,
    pub length: u16,
    pub frame: u64,
}
#[test]
fn bindgen_test_layout_grant_entry_v2__bindgen_ty_2() {
    assert_eq!(
        ::std::mem::size_of::<grant_entry_v2__bindgen_ty_2>(),
        16usize,
        concat!("Size of: ", stringify!(grant_entry_v2__bindgen_ty_2))
    );
    assert_eq!(
        ::std::mem::align_of::<grant_entry_v2__bindgen_ty_2>(),
        8usize,
        concat!("Alignment of ", stringify!(grant_entry_v2__bindgen_ty_2))
    );
    fn test_field_hdr() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<grant_entry_v2__bindgen_ty_2>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).hdr) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(grant_entry_v2__bindgen_ty_2),
                "::",
                stringify!(hdr)
            )
        );
    }
    test_field_hdr();
    fn test_field_page_off() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<grant_entry_v2__bindgen_ty_2>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).page_off) as usize - ptr as usize
            },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(grant_entry_v2__bindgen_ty_2),
                "::",
                stringify!(page_off)
            )
        );
    }
    test_field_page_off();
    fn test_field_length() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<grant_entry_v2__bindgen_ty_2>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).length) as usize - ptr as usize
            },
            6usize,
            concat!(
                "Offset of field: ",
                stringify!(grant_entry_v2__bindgen_ty_2),
                "::",
                stringify!(length)
            )
        );
    }
    test_field_length();
    fn test_field_frame() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<grant_entry_v2__bindgen_ty_2>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).frame) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(grant_entry_v2__bindgen_ty_2),
                "::",
                stringify!(frame)
            )
        );
    }
    test_field_frame();
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct grant_entry_v2__bindgen_ty_3 {
    pub hdr: grant_entry_header_t,
    pub trans_domid: domid_t,
    pub pad0: u16,
    pub gref: grant_ref_t,
}
#[test]
fn bindgen_test_layout_grant_entry_v2__bindgen_ty_3() {
    assert_eq!(
        ::std::mem::size_of::<grant_entry_v2__bindgen_ty_3>(),
        12usize,
        concat!("Size of: ", stringify!(grant_entry_v2__bindgen_ty_3))
    );
    assert_eq!(
        ::std::mem::align_of::<grant_entry_v2__bindgen_ty_3>(),
        4usize,
        concat!("Alignment of ", stringify!(grant_entry_v2__bindgen_ty_3))
    );
    fn test_field_hdr() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<grant_entry_v2__bindgen_ty_3>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).hdr) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(grant_entry_v2__bindgen_ty_3),
                "::",
                stringify!(hdr)
            )
        );
    }
    test_field_hdr();
    fn test_field_trans_domid() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<grant_entry_v2__bindgen_ty_3>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).trans_domid) as usize - ptr as usize
            },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(grant_entry_v2__bindgen_ty_3),
